[
  {
    "id": 16498,
    "title": "Shingeki no Kyojin",
    "synonyms": "AoT, SnK",
    "japanese": "進撃の巨人",
    "english": "Attack on Titan",
    "synopsis": "Centuries ago, mankind was slaughtered to near extinction by monstrous humanoid creatures called Titans, forcing humans to hide in fear behind enormous concentric walls. What makes these giants truly terrifying is that their taste for human flesh is not born out of hunger but what appears to be out of pleasure. To ensure their survival, the remnants of humanity began living within defensive barriers, resulting in one hundred years without a single titan encounter. However, that fragile calm is soon shattered when a colossal Titan manages to breach the supposedly impregnable outer wall, reigniting the fight for survival against the man-eating abominations. After witnessing a horrific personal loss at the hands of the invading creatures, Eren Yeager dedicates his life to their eradication by enlisting into the Survey Corps, an elite military unit that combats the merciless humanoids outside the protection of the walls. Eren, his adopted sister Mikasa Ackerman, and his childhood friend Armin Arlert join the brutal war against the Titans and race to discover a way of defeating them before the last walls are breached. [Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 25,
    "status": "Finished Airing",
    "start_Aired": "Apr 7, 2013",
    "end_Aired": "Sep 29, 2013",
    "premiered": "Spring 2013",
    "broadcast": "Sundays at 0158 (JST)",
    "producers": "Production I.G, Dentsu, Mainichi broadcasting System, Pony Canyon, Kodansha, Mad Box, Pony Canyon Enterprise",
    "licensors": "Funimation",
    "studios": "Wit Studio",
    "source": "Manga",
    "genres": "Action, Drama",
    "themes": "Gore, Military, Survival",
    "demographics": "Shounen",
    "duration_Minutes": 24,
    "rating": "R - 17+ (violence & profanity)",
    "score": 8.531,
    "scored_Users": 519803,
    "ranked": 1002,
    "popularity": 1,
    "members": 3524109,
    "favorites": 155695
  },
  {
    "id": 1535,
    "title": "Death Note",
    "synonyms": "DN",
    "japanese": "デスノート",
    "english": "Death Note",
    "synopsis": "Brutal murders, petty thefts, and senseless violence pollute the human world. In contrast, the realm of death gods is a humdrum, unchanging gambling den. The ingenious 17-year-old japanese student Light Yagami and sadistic god of death Ryuk share one belief: their worlds are rotten.For his own amusement, Ryuk drops his Death Note into the human world. Light stumbles upon it, deeming the first of its rules ridiculous: the human whose name is written in this note shall die. However, the temptation is too great, and Light experiments by writing a felon's name, which disturbingly enacts his first murder.Aware of the terrifying godlike power that has fallen into his hands, Light—under the alias Kira—follows his wicked sense of justice with the ultimate goal of cleansing the world of all evil-doers. The meticulous mastermind detective L is already on his trail, but as Light's brilliance rivals L's, the grand chase for Kira turns into an intense battle of wits that can only end when one of them is dead.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 37,
    "status": "Finished Airing",
    "start_Aired": "Oct 4, 2006",
    "end_Aired": "Jun 27, 2007",
    "premiered": "Fall 2006",
    "broadcast": "Wednesdays at 0056 (JST)",
    "producers": "VAP, Konami, Ashi Productions, Nippon Television Network, Shueisha",
    "licensors": "VIZ Media",
    "studios": "Madhouse",
    "source": "Manga",
    "genres": "Supernatural, Suspense",
    "themes": "Psychological",
    "demographics": "Shounen",
    "duration_Minutes": 23,
    "rating": "R - 17+ (violence & profanity)",
    "score": 8.621,
    "scored_Users": 485487,
    "ranked": 732,
    "popularity": 2,
    "members": 3504535,
    "favorites": 159701
  },
  {
    "id": 5114,
    "title": "Fullmetal Alchemist: Brotherhood",
    "synonyms": "Hagane no Renkinjutsushi Fullmetal Alchemist, Fullmetal Alchemist (2009), FMA, FMAB",
    "japanese": "鋼の錬金術師 FULLMETAL ALCHEMIST",
    "english": "Fullmetal Alchemist Brotherhood",
    "synopsis": "After a horrific alchemy experiment goes wrong in the Elric household, brothers Edward and Alphonse are left in a catastrophic new reality. Ignoring the alchemical principle banning human transmutation, the boys attempted to bring their recently deceased mother back to life. Instead, they suffered brutal personal loss: Alphonse's body disintegrated while Edward lost a leg and then sacrificed an arm to keep Alphonse's soul in the physical realm by binding it to a hulking suit of armor.The brothers are rescued by their neighbor Pinako Rockbell and her granddaughter Winry. Known as a bio-mechanical engineering prodigy, Winry creates prosthetic limbs for Edward by utilizing automail, a tough, versatile metal used in robots and combat armor. After years of training, the Elric brothers set off on a quest to restore their bodies by locating the Philosopher's Stone—a powerful gem that allows an alchemist to defy the traditional laws of Equivalent Exchange.As Edward becomes an infamous alchemist and gains the nickname Fullmetal, the boys' journey embroils them in a growing conspiracy that threatens the fate of the world.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 64,
    "status": "Finished Airing",
    "start_Aired": "Apr 5, 2009",
    "end_Aired": "Jul 4, 2010",
    "premiered": "Spring 2009",
    "broadcast": "Sundays at 1700 (JST)",
    "producers": "Aniplex, Square Enix, Mainichi broadcasting System, Studio Moriken",
    "licensors": "Funimation, Aniplex of America",
    "studios": "Bones",
    "source": "Manga",
    "genres": "Action, Adventure, Drama, Fantasy",
    "themes": "Military",
    "demographics": "Shounen",
    "duration_Minutes": 24,
    "rating": "R - 17+ (violence & profanity)",
    "score": 9.131,
    "scored_Users": 900398,
    "ranked": 12,
    "popularity": 3,
    "members": 2978455,
    "favorites": 207772
  },
  {
    "id": 30276,
    "title": "One Punch Man",
    "synonyms": "One Punch-Man, One-Punch Man, OPM",
    "japanese": "ワンパンマン",
    "english": "One Punch Man",
    "synopsis": "The seemingly unimpressive Saitama has a rather unique hobby: being a hero. In order to pursue his childhood dream, Saitama relentlessly trained for three years, losing all of his hair in the process. Now, Saitama is so powerful, he can defeat any enemy with just one punch. However, having no one capable of matching his strength has led Saitama to an unexpected problem—he is no longer able to enjoy the thrill of battling and has become quite bored.One day, Saitama catches the attention of 19-year-old cyborg Genos, who witnesses his power and wishes to become Saitama's disciple. Genos proposes that the two join the Hero Association in order to become certified heroes that will be recognized for their positive contributions to society. Saitama, who is shocked that no one knows who he is, quickly agrees. Meeting new allies and taking on new foes, Saitama embarks on a new journey as a member of the Hero Association to experience the excitement of battle he once felt.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 12,
    "status": "Finished Airing",
    "start_Aired": "Oct 5, 2015",
    "end_Aired": "Dec 21, 2015",
    "premiered": "Fall 2015",
    "broadcast": "Mondays at 0105 (JST)",
    "producers": "TV Tokyo, Bandai Visual, Lantis, Asatsu DK, Banpresto, Good Smile Company, Shueisha, JR East Marketing & Communications",
    "licensors": "VIZ Media",
    "studios": "Madhouse",
    "source": "Web manga",
    "genres": "Action, Comedy",
    "themes": "Parody, Super Power",
    "demographics": "Seinen",
    "duration_Minutes": 24,
    "rating": "R - 17+ (violence & profanity)",
    "score": 8.511,
    "scored_Users": 19066,
    "ranked": 1112,
    "popularity": 4,
    "members": 2879907,
    "favorites": 59651
  },
  {
    "id": 11757,
    "title": "Sword Art Online",
    "synonyms": "S.A.O, SAO",
    "japanese": "ソードアート・オンライン",
    "english": "Sword Art Online",
    "synopsis": "Ever since the release of the innovative NerveGear, gamers from all around the globe have been given the opportunity to experience a completely immersive virtual reality. Sword Art Online (SAO), one of the most recent games on the console, offers a gateway into the wondrous world of Aincrad, a vivid, medieval landscape where users can do anything within the limits of imagination. With the release of this worldwide sensation, gaming has never felt more lifelike.However, the idyllic fantasy rapidly becomes a brutal nightmare when SAO's creator traps thousands of players inside the game. The log-out function has been removed, with the only method of escape involving beating all of Aincrad's one hundred increasingly difficult levels. Adding to the struggle, any in-game death becomes permanent, ending the player's life in the real world.While Kazuto Kirito Kirigaya was fortunate enough to be a beta-tester for the game, he quickly finds that despite his advantages, he cannot overcome SAO's challenges alone. Teaming up with Asuna Yuuki and other talented players, Kirito makes an effort to face the seemingly insurmountable trials head-on. But with difficult bosses and threatening dark cults impeding his progress, Kirito finds that such tasks are much easier said than done.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 25,
    "status": "Finished Airing",
    "start_Aired": "Jul 8, 2012",
    "end_Aired": "Dec 23, 2012",
    "premiered": "Summer 2012",
    "broadcast": "Sundays at 0000 (JST)",
    "producers": "Aniplex, Genco, DAX Production, ASCII Media Works, Bandai Namco Games",
    "licensors": "Aniplex of America",
    "studios": "A-1 Pictures",
    "source": "Light novel",
    "genres": "Action, Adventure, Fantasy, Romance",
    "themes": "Love Polygon, Video Game",
    "demographics": "Unknown",
    "duration_Minutes": 23,
    "rating": "PG-13 - Teens 13 or older",
    "score": 7.201,
    "scored_Users": 990254,
    "ranked": 29562,
    "popularity": 5,
    "members": 2813565,
    "favorites": 64997
  },
  {
    "id": 31964,
    "title": "Boku no Hero Academia",
    "synonyms": "Unknown",
    "japanese": "僕のヒーローアカデミア",
    "english": "My Hero Academia",
    "synopsis": "The appearance of quirks, newly discovered super powers, has been steadily increasing over the years, with 80 percent of humanity possessing various abilities from manipulation of elements to shapeshifting. This leaves the remainder of the world completely powerless, and Izuku Midoriya is one such individual.Since he was a child, the ambitious middle schooler has wanted nothing more than to be a hero. Izuku's unfair fate leaves him admiring heroes and taking notes on them whenever he can. But it seems that his persistence has borne some fruit: Izuku meets the number one hero and his personal idol, All Might. All Might's quirk is a unique ability that can be inherited, and he has chosen Izuku to be his successor!Enduring many months of grueling training, Izuku enrolls in UA High, a prestigious high school famous for its excellent hero training program, and this year's freshmen look especially promising. With his bizarre but talented classmates and the looming threat of a villainous organization, Izuku will soon learn what it really means to be a hero.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 13,
    "status": "Finished Airing",
    "start_Aired": "Apr 3, 2016",
    "end_Aired": "Jun 26, 2016",
    "premiered": "Spring 2016",
    "broadcast": "Sundays at 1700 (JST)",
    "producers": "Dentsu, Mainichi broadcasting System, Movic, TOHO animation, Shueisha",
    "licensors": "Funimation",
    "studios": "Bones",
    "source": "Manga",
    "genres": "Action",
    "themes": "School, Super Power",
    "demographics": "Shounen",
    "duration_Minutes": 24,
    "rating": "PG-13 - Teens 13 or older",
    "score": 7.921,
    "scored_Users": 871325,
    "ranked": 6722,
    "popularity": 6,
    "members": 2708684,
    "favorites": 52169
  },
  {
    "id": 20,
    "title": "Naruto",
    "synonyms": "NARUTO",
    "japanese": "ナルト",
    "english": "Naruto",
    "synopsis": "Moments prior to Naruto Uzumaki's birth, a huge demon known as the Kyuubi, the Nine-Tailed Fox, attacked Konohagakure, the Hidden Leaf Village, and wreaked havoc. In order to put an end to the Kyuubi's rampage, the leader of the village, the Fourth Hokage, sacrificed his life and sealed the monstrous beast inside the newborn Naruto.Now, Naruto is a hyperactive and knuckle-headed ninja still living in Konohagakure. Shunned because of the Kyuubi inside him, Naruto struggles to find his place in the village, while his burning desire to become the Hokage of Konohagakure leads him not only to some great new friends, but also some deadly foes.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 220,
    "status": "Finished Airing",
    "start_Aired": "Oct 3, 2002",
    "end_Aired": "Feb 8, 2007",
    "premiered": "Fall 2002",
    "broadcast": "Thursdays at 1930 (JST)",
    "producers": "TV Tokyo, Aniplex, Shueisha",
    "licensors": "VIZ Media",
    "studios": "Pierrot",
    "source": "Manga",
    "genres": "Action, Adventure, Fantasy",
    "themes": "Martial Arts",
    "demographics": "Shounen",
    "duration_Minutes": 23,
    "rating": "PG-13 - Teens 13 or older",
    "score": 7.971,
    "scored_Users": 784527,
    "ranked": 5982,
    "popularity": 7,
    "members": 2557342,
    "favorites": 71876
  },
  {
    "id": 22319,
    "title": "Tokyo Ghoul",
    "synonyms": "Tokyo Kushu, Toukyou Kushu, Toukyou Ghoul",
    "japanese": "東京喰種-トーキョーグール-",
    "english": "Tokyo Ghoul",
    "synopsis": "A sinister threat is invading Tokyo: flesh-eating ghouls who appear identical to humans and blend into their population. Reserved college student Ken Kaneki buries his nose in books and avoids the news of the growing crisis. However, the appearance of an attractive woman named Rize Kamishiro shatters his solitude when she forwardly asks him on a date.While walking Rize home, Kaneki discovers she isn't as kind as she first appeared, and she has led him on with sinister intent. After a tragic struggle, he later awakens in a hospital to learn his life was saved by transplanting the now deceased Rize's organs into his own body. Kaneki's body begins to change in horrifying ways, and he transforms into a human-ghoul hybrid. As he embarks on his new dreadful journey, Kaneki clings to his humanity in the evolving bloody conflict between society's new monsters and the government agents who hunt them.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 12,
    "status": "Finished Airing",
    "start_Aired": "Jul 4, 2014",
    "end_Aired": "Sep 19, 2014",
    "premiered": "Summer 2014",
    "broadcast": "Fridays at 0000 (JST)",
    "producers": "Marvelous AQL, TC Entertainment, Shueisha",
    "licensors": "Funimation",
    "studios": "Pierrot",
    "source": "Manga",
    "genres": "Action, Fantasy, Horror",
    "themes": "Gore, Psychological",
    "demographics": "Seinen",
    "duration_Minutes": 24,
    "rating": "R - 17+ (violence & profanity)",
    "score": 7.791,
    "scored_Users": 708575,
    "ranked": 9082,
    "popularity": 8,
    "members": 2556441,
    "favorites": 47433
  },
  {
    "id": 38000,
    "title": "Kimetsu no Yaiba",
    "synonyms": "Blade of Demon Destruction",
    "japanese": "鬼滅の刃",
    "english": "Demon Slayer Kimetsu no Yaiba",
    "synopsis": "Ever since the death of his father, the burden of supporting the family has fallen upon Tanjirou Kamado's shoulders. Though living impoverished on a remote mountain, the Kamado family are able to enjoy a relatively peaceful and happy life. One day, Tanjirou decides to go down to the local village to make a little money selling charcoal. On his way back, night falls, forcing Tanjirou to take shelter in the house of a strange man, who warns him of the existence of flesh-eating demons that lurk in the woods at night.When he finally arrives back home the next day, he is met with a horrifying sight—his whole family has been slaughtered. Worse still, the sole survivor is his sister Nezuko, who has been turned into a bloodthirsty demon. Consumed by rage and hatred, Tanjirou swears to avenge his family and stay by his only remaining sibling. Alongside the mysterious group calling themselves the Demon Slayer Corps, Tanjirou will do whatever it takes to slay the demons and protect the remnants of his beloved sister's humanity.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 26,
    "status": "Finished Airing",
    "start_Aired": "Apr 6, 2019",
    "end_Aired": "Sep 28, 2019",
    "premiered": "Spring 2019",
    "broadcast": "Saturdays at 2330 (JST)",
    "producers": "Aniplex, Shueisha",
    "licensors": "Aniplex of America",
    "studios": "ufotable",
    "source": "Manga",
    "genres": "Action, Fantasy",
    "themes": "Historical",
    "demographics": "Shounen",
    "duration_Minutes": 23,
    "rating": "R - 17+ (violence & profanity)",
    "score": 8.531,
    "scored_Users": 774255,
    "ranked": 1042,
    "popularity": 9,
    "members": 2550468,
    "favorites": 83110
  },
  {
    "id": 11061,
    "title": "Hunter x Hunter (2011)",
    "synonyms": "HxH (2011)",
    "japanese": "HUNTER×HUNTER（ハンター×ハンター）",
    "english": "Hunter x Hunter",
    "synopsis": "Hunters devote themselves to accomplishing hazardous tasks, all from traversing the world's uncharted territories to locating rare items and monsters. Before becoming a Hunter, one must pass the Hunter Examination—a high-risk selection process in which most applicants end up handicapped or worse, deceased.Ambitious participants who challenge the notorious exam carry their own reason. What drives 12-year-old Gon Freecss is finding Ging, his father and a Hunter himself. Believing that he will meet his father by becoming a Hunter, Gon takes the first step to walk the same path.During the Hunter Examination, Gon befriends the medical student Leorio Paladiknight, the vindictive Kurapika, and ex-assassin Killua Zoldyck. While their motives vastly differ from each other, they band together for a common goal and begin to venture into a perilous world.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 148,
    "status": "Finished Airing",
    "start_Aired": "Oct 2, 2011",
    "end_Aired": "Sep 24, 2014",
    "premiered": "Fall 2011",
    "broadcast": "Sundays at 1055 (JST)",
    "producers": "VAP, Nippon Television Network, Shueisha",
    "licensors": "VIZ Media",
    "studios": "Madhouse",
    "source": "Manga",
    "genres": "Action, Adventure, Fantasy",
    "themes": "Unknown",
    "demographics": "Shounen",
    "duration_Minutes": 23,
    "rating": "PG-13 - Teens 13 or older",
    "score": 9.041,
    "scored_Users": 538454,
    "ranked": 92,
    "popularity": 10,
    "members": 2464157,
    "favorites": 188649
  },
  {
    "id": 32281,
    "title": "Kimi no Na wa.",
    "synonyms": "Unknown",
    "japanese": "君の名は。",
    "english": "Your Name.",
    "synopsis": "Mitsuha Miyamizu, a high school girl, yearns to live the life of a boy in the bustling city of Tokyo—a dream that stands in stark contrast to her present life in the countryside. Meanwhile in the city, Taki Tachibana lives a busy life as a high school student while juggling his part-time job and hopes for a future in architecture.One day, Mitsuha awakens in a room that is not her own and suddenly finds herself living the dream life in Tokyo—but in Taki's body! Elsewhere, Taki finds himself living Mitsuha's life in the humble countryside. In pursuit of an answer to this strange phenomenon, they begin to search for one another.Kimi no Na wa. revolves around Mitsuha and Taki's actions, which begin to have a dramatic impact on each other's lives, weaving them into a fabric held together by fate and circumstance.[Written by MAL Rewrite]",
    "type": "Movie",
    "episodes": 1,
    "status": "Finished Airing",
    "start_Aired": "Aug 26, 2016",
    "end_Aired": "Not Available",
    "premiered": "Unknown",
    "broadcast": "Unknown",
    "producers": "Toho, Sound Team Don Juan, Amuse, JR East Marketing & Communications, Kadokawa, voque ting",
    "licensors": "Funimation, NYAV Post",
    "studios": "CoMix Wave Films",
    "source": "Original",
    "genres": "Drama, Supernatural",
    "themes": "Romantic Subtext",
    "demographics": "Unknown",
    "duration_Minutes": 106,
    "rating": "PG-13 - Teens 13 or older",
    "score": 8.861,
    "scored_Users": 701857,
    "ranked": 222,
    "popularity": 11,
    "members": 2429958,
    "favorites": 83505
  },
  {
    "id": 25777,
    "title": "Shingeki no Kyojin Season 2",
    "synonyms": "Unknown",
    "japanese": "進撃の巨人 Season2",
    "english": "Attack on Titan Season 2",
    "synopsis": "For centuries, humanity has been hunted by giant, mysterious predators known as the Titans. Three mighty walls—Wall Maria, Rose, and Sheena—provided peace and protection for humanity for over a hundred years. That peace, however, was shattered when the Colossal Titan and Armored Titan appeared and destroyed the outermost wall, Wall Maria. Forced to retreat behind Wall Rose, humanity waited with bated breath for the Titans to reappear and destroy their safe haven once more.In Shingeki no Kyojin Season 2, Eren Yeager and others of the 104th Training Corps have just begun to become full members of the Survey Corps. As they ready themselves to face the Titans once again, their preparations are interrupted by the invasion of Wall Rose—but all is not as it seems as more mysteries are unraveled. As the Survey Corps races to save the wall, they uncover more about the invading Titans and the dark secrets of their own members.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 12,
    "status": "Finished Airing",
    "start_Aired": "Apr 1, 2017",
    "end_Aired": "Jun 17, 2017",
    "premiered": "Spring 2017",
    "broadcast": "Saturdays at 2200 (JST)",
    "producers": "Production I.G, Dentsu, Mainichi broadcasting System, Pony Canyon, Kodansha, Techno Sound, Pony Canyon Enterprise",
    "licensors": "Funimation",
    "studios": "Wit Studio",
    "source": "Manga",
    "genres": "Action, Drama",
    "themes": "Gore, Military, Survival",
    "demographics": "Shounen",
    "duration_Minutes": 24,
    "rating": "R - 17+ (violence & profanity)",
    "score": 8.501,
    "scored_Users": 650516,
    "ranked": 1192,
    "popularity": 12,
    "members": 2395390,
    "favorites": 20123
  },
  {
    "id": 9253,
    "title": "Steins;Gate",
    "synonyms": "Unknown",
    "japanese": "STEINS;GATE",
    "english": "Steins;Gate",
    "synopsis": "Eccentric scientist Rintarou Okabe has a never-ending thirst for scientific exploration. Together with his ditzy but well-meaning friend Mayuri Shiina and his roommate Itaru Hashida, Rintarou founds the Future Gadget Laboratory in the hopes of creating technological innovations that baffle the human psyche. Despite claims of grandeur, the only notable gadget the trio have created is a microwave that has the mystifying power to turn bananas into green goo.However, when Rintarou decides to attend neuroscientist Kurisu Makise's conference on time travel, he experiences a series of strange events that lead him to believe that there is more to the Phone Microwave gadget than meets the eye. Apparently able to send text messages into the past using the microwave, Rintarou dabbles further with the time machine, attracting the ire and attention of the mysterious organization SERN.Due to the novel discovery, Rintarou and his friends find themselves in an ever-present danger. As he works to mitigate the damage his invention has caused to the timeline, he is not only fighting a battle to save his loved ones, but also one against his degrading sanity.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 24,
    "status": "Finished Airing",
    "start_Aired": "Apr 6, 2011",
    "end_Aired": "Sep 14, 2011",
    "premiered": "Spring 2011",
    "broadcast": "Wednesdays at 0205 (JST)",
    "producers": "Frontier Works, Media Factory, Movic, AT-X, Kadokawa Pictures Japan, Nitroplus",
    "licensors": "Funimation",
    "studios": "White Fox",
    "source": "Visual novel",
    "genres": "Drama, Sci-Fi, Suspense",
    "themes": "Psychological, Time Travel",
    "demographics": "Unknown",
    "duration_Minutes": 24,
    "rating": "PG-13 - Teens 13 or older",
    "score": 9.081,
    "scored_Users": 268716,
    "ranked": 42,
    "popularity": 13,
    "members": 2299690,
    "favorites": 175248
  },
  {
    "id": 33486,
    "title": "Boku no Hero Academia 2nd Season",
    "synonyms": "Unknown",
    "japanese": "僕のヒーローアカデミア",
    "english": "My Hero Academia Season 2",
    "synopsis": "At UA Academy, not even a violent attack can disrupt their most prestigious event: the school sports festival. Renowned across Japan, this festival is an opportunity for aspiring heroes to showcase their abilities, both to the public and potential recruiters.However, the path to glory is never easy, especially for Izuku Midoriya—whose quirk possesses great raw power but is also cripplingly inefficient. Pitted against his talented classmates, such as the fire and ice wielding Shouto Todoroki, Izuku must utilize his sharp wits and master his surroundings to achieve victory and prove to the world his worth.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 25,
    "status": "Finished Airing",
    "start_Aired": "Apr 1, 2017",
    "end_Aired": "Sep 30, 2017",
    "premiered": "Spring 2017",
    "broadcast": "Saturdays at 1730 (JST)",
    "producers": "Dentsu, Yomiuri Telecasting, Movic, Sony Music Entertainment, TOHO animation, Shueisha",
    "licensors": "Funimation",
    "studios": "Bones",
    "source": "Manga",
    "genres": "Action",
    "themes": "School, Super Power",
    "demographics": "Shounen",
    "duration_Minutes": 23,
    "rating": "PG-13 - Teens 13 or older",
    "score": 8.141,
    "scored_Users": 568249,
    "ranked": 3902,
    "popularity": 14,
    "members": 2268720,
    "favorites": 17147
  },
  {
    "id": 19815,
    "title": "No Game No Life",
    "synonyms": "NGNL",
    "japanese": "ノーゲーム・ノーライフ",
    "english": "No Game, No Life",
    "synopsis": "Sixteen sentient races inhabit Disboard, a world overseen by Tet, the One True God. The lowest of the sixteen—Imanity—consists of humans, a race with no affinity for magic. In a place where everything is decided through simple games, humankind seems to have no way out of their predicament—but the arrival of two outsiders poses a change.On Earth, stepsiblings Sora and Shiro are two inseparable shut-ins who dominate various online games under the username Blank. While notorious on the internet, the pair believe that life is merely another dull game. However, after responding to a message from an unknown user, they are suddenly transported to Disboard. The mysterious sender turns out to be Tet, who informs them about the world's absolute rules. After Tet leaves, Sora and Shiro begin their search for more information and a place to stay, taking them to Elkia—Imanity's only remaining kingdom.There, the duo encounters Stephanie Dola, an emotional girl vying for the kingdom's sovereignty. In desperation, she attempts to regain her father's throne, but her foolhardiness makes her goal unachievable. Inspired by the girl's motivation and passion, Sora and Shiro decide to aid Stephanie in getting Elkia back on its feet, ultimately aiming to become the new rulers of the enigmatic realm.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 12,
    "status": "Finished Airing",
    "start_Aired": "Apr 9, 2014",
    "end_Aired": "Jun 25, 2014",
    "premiered": "Spring 2014",
    "broadcast": "Wednesdays at 2130 (JST)",
    "producers": "Frontier Works, Media Factory, Movic, AT-X",
    "licensors": "Sentai Filmworks",
    "studios": "Madhouse",
    "source": "Light novel",
    "genres": "Comedy, Fantasy, Ecchi",
    "themes": "Isekai, Strategy Game",
    "demographics": "Unknown",
    "duration_Minutes": 23,
    "rating": "PG-13 - Teens 13 or older",
    "score": 8.101,
    "scored_Users": 427730,
    "ranked": 4402,
    "popularity": 15,
    "members": 2201000,
    "favorites": 46672
  },
  {
    "id": 1735,
    "title": "Naruto: Shippuuden",
    "synonyms": "Naruto Hurricane Chronicles",
    "japanese": "ナルト- 疾風伝",
    "english": "Naruto Shippuden",
    "synopsis": "It has been two and a half years since Naruto Uzumaki left Konohagakure, the Hidden Leaf Village, for intense training following events which fueled his desire to be stronger. Now Akatsuki, the mysterious organization of elite rogue ninja, is closing in on their grand plan which may threaten the safety of the entire shinobi world.Although Naruto is older and sinister events loom on the horizon, he has changed little in personality—still rambunctious and childish—though he is now far more confident and possesses an even greater determination to protect his friends and home. Come whatever may, Naruto will carry on with the fight for what is important to him, even at the expense of his own body, in the continuation of the saga about the boy who wishes to become Hokage.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 500,
    "status": "Finished Airing",
    "start_Aired": "Feb 15, 2007",
    "end_Aired": "Mar 23, 2017",
    "premiered": "Winter 2007",
    "broadcast": "Thursdays at 1930 (JST)",
    "producers": "TV Tokyo, Aniplex, KSS, Rakuonsha, TV Tokyo Music, Shueisha",
    "licensors": "VIZ Media",
    "studios": "Pierrot",
    "source": "Manga",
    "genres": "Action, Adventure, Fantasy",
    "themes": "Martial Arts",
    "demographics": "Shounen",
    "duration_Minutes": 23,
    "rating": "PG-13 - Teens 13 or older",
    "score": 8.241,
    "scored_Users": 470641,
    "ranked": 2892,
    "popularity": 16,
    "members": 2188005,
    "favorites": 100796
  },
  {
    "id": 1575,
    "title": "Code Geass: Hangyaku no Lelouch",
    "synonyms": "Unknown",
    "japanese": "コードギアス 反逆のルルーシュ",
    "english": "Code Geass Lelouch of the Rebellion",
    "synopsis": "In the year 2010, the Holy Empire of Britannia is establishing itself as a dominant military nation, starting with the conquest of Japan. Renamed to Area 11 after its swift defeat, Japan has seen significant resistance against these tyrants in an attempt to regain independence.Lelouch Lamperouge, a Britannian student, unfortunately finds himself caught in a crossfire between the Britannian and the Area 11 rebel armed forces. He is able to escape, however, thanks to the timely appearance of a mysterious girl named C.C., who bestows upon him Geass, the Power of Kings. Realizing the vast potential of his newfound power of absolute obedience, Lelouch embarks upon a perilous journey as the masked vigilante known as Zero, leading a merciless onslaught against Britannia in order to get revenge once and for all.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 25,
    "status": "Finished Airing",
    "start_Aired": "Oct 6, 2006",
    "end_Aired": "Jul 29, 2007",
    "premiered": "Fall 2006",
    "broadcast": "Fridays at 0125 (JST)",
    "producers": "Bandai Visual, Mainichi broadcasting System, Bandai, Sony Music Entertainment, Bandai Namco Entertainment, Hakuhodo DY Media Partners",
    "licensors": "Funimation, Bandai Entertainment",
    "studios": "Sunrise",
    "source": "Original",
    "genres": "Action, Drama, Sci-Fi",
    "themes": "Mecha, Military, School, Super Power",
    "demographics": "Unknown",
    "duration_Minutes": 24,
    "rating": "R - 17+ (violence & profanity)",
    "score": 8.701,
    "scored_Users": 283272,
    "ranked": 492,
    "popularity": 17,
    "members": 2041222,
    "favorites": 101425
  },
  {
    "id": 35760,
    "title": "Shingeki no Kyojin Season 3",
    "synonyms": "Unknown",
    "japanese": "進撃の巨人 Season3",
    "english": "Attack on Titan Season 3",
    "synopsis": "Still threatened by the Titans that rob them of their freedom, mankind remains caged inside the two remaining walls. Efforts to eradicate these monsters continue; however, threats arise not only from the Titans beyond the walls, but from the humans within them as well.After being rescued from the Colossal and Armored Titans, Eren Yaeger devotes himself to improving his Titan form. Krista Lenz struggles to accept the loss of her friend, Captain Levi chooses Eren and his friends to form his new personal squad, and Commander Erwin Smith recovers from his injuries. All seems well for the soldiers, until the government suddenly demands custody of Eren and Krista. The Survey Corps' recent successes have drawn attention, and a familiar face from Levi's past is sent to collect the wanted soldiers. Sought after by the government, Levi and his new squad must evade their adversaries in hopes of keeping Eren and Krista safe.In Shingeki no Kyojin Season 3, Eren and his fellow soldiers are not only fighting for their survival against the terrifying Titans, but also against the terror of a far more conniving foe: humans.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 12,
    "status": "Finished Airing",
    "start_Aired": "Jul 23, 2018",
    "end_Aired": "Oct 15, 2018",
    "premiered": "Summer 2018",
    "broadcast": "Mondays at 0035 (JST)",
    "producers": "Production I.G, Dentsu, Mainichi broadcasting System, Pony Canyon, Kodansha, Techno Sound, Pony Canyon Enterprise",
    "licensors": "Funimation",
    "studios": "Wit Studio",
    "source": "Manga",
    "genres": "Action, Drama",
    "themes": "Gore, Military, Survival",
    "demographics": "Shounen",
    "duration_Minutes": 23,
    "rating": "R - 17+ (violence & profanity)",
    "score": 8.621,
    "scored_Users": 394608,
    "ranked": 722,
    "popularity": 18,
    "members": 2040096,
    "favorites": 18914
  },
  {
    "id": 28851,
    "title": "Koe no Katachi",
    "synonyms": "The Shape of Voice",
    "japanese": "聲の形",
    "english": "A Silent Voice",
    "synopsis": "As a wild youth, elementary school student Shouya Ishida sought to beat boredom in the cruelest ways. When the deaf Shouko Nishimiya transfers into his class, Shouya and the rest of his class thoughtlessly bully her for fun. However, when her mother notifies the school, he is singled out and blamed for everything done to her. With Shouko transferring out of the school, Shouya is left at the mercy of his classmates. He is heartlessly ostracized all throughout elementary and middle school, while teachers turn a blind eye.Now in his third year of high school, Shouya is still plagued by his wrongdoings as a young boy. Sincerely regretting his past actions, he sets out on a journey of redemption: to meet Shouko once more and make amends.Koe no Katachi tells the heartwarming tale of Shouya's reunion with Shouko and his honest attempts to redeem himself, all while being continually haunted by the shadows of his past.[Written by MAL Rewrite]",
    "type": "Movie",
    "episodes": 1,
    "status": "Finished Airing",
    "start_Aired": "Sep 17, 2016",
    "end_Aired": "Not Available",
    "premiered": "Unknown",
    "broadcast": "Unknown",
    "producers": "Shochiku, Pony Canyon, Kodansha, ABC Animation, Quaras",
    "licensors": "Eleven Arts, NYAV Post",
    "studios": "Kyoto Animation",
    "source": "Manga",
    "genres": "Drama",
    "themes": "Romantic Subtext",
    "demographics": "Shounen",
    "duration_Minutes": 130,
    "rating": "PG-13 - Teens 13 or older",
    "score": 8.951,
    "scored_Users": 423905,
    "ranked": 152,
    "popularity": 19,
    "members": 2037114,
    "favorites": 78715
  },
  {
    "id": 4224,
    "title": "Toradora!",
    "synonyms": "Tiger X Dragon",
    "japanese": "とらドラ！",
    "english": "Toradora!",
    "synopsis": "Ryuuji Takasu is a gentle high school student with a love for housework; but in contrast to his kind nature, he has an intimidating face that often gets him labeled as a delinquent. On the other hand is Taiga Aisaka, a small, doll-like student, who is anything but a cute and fragile girl. Equipped with a wooden katana and feisty personality, Taiga is known throughout the school as the Palmtop Tiger.One day, an embarrassing mistake causes the two students to cross paths. Ryuuji discovers that Taiga actually has a sweet side: she has a crush on the popular vice president, Yuusaku Kitamura, who happens to be his best friend. But things only get crazier when Ryuuji reveals that he has a crush on Minori Kushieda—Taiga's best friend!Toradora! is a romantic comedy that follows this odd duo as they embark on a quest to help each other with their respective crushes, forming an unlikely alliance in the process.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 25,
    "status": "Finished Airing",
    "start_Aired": "Oct 2, 2008",
    "end_Aired": "Mar 26, 2009",
    "premiered": "Fall 2008",
    "broadcast": "Thursdays at 0120 (JST)",
    "producers": "Genco, Starchild Records, Magic Capsule, Yomiuri Advertising, TV Tokyo Music",
    "licensors": "NIS America, Inc.",
    "studios": "J.C.Staff",
    "source": "Light novel",
    "genres": "Drama, Romance",
    "themes": "Love Polygon, School",
    "demographics": "Unknown",
    "duration_Minutes": 24,
    "rating": "PG-13 - Teens 13 or older",
    "score": 8.101,
    "scored_Users": 273470,
    "ranked": 4452,
    "popularity": 20,
    "members": 2021782,
    "favorites": 54069
  },
  {
    "id": 23273,
    "title": "Shigatsu wa Kimi no Uso",
    "synonyms": "Kimiuso",
    "japanese": "四月は君の嘘",
    "english": "Your Lie in April",
    "synopsis": "Kousei Arima is a child prodigy known as the Human Metronome for playing the piano with precision and perfection. Guided by a strict mother and rigorous training, Kousei dominates every competition he enters, earning the admiration of his musical peers and praise from audiences. When his mother suddenly passes away, the subsequent trauma makes him unable to hear the sound of a piano, and he never takes the stage thereafter.Nowadays, Kousei lives a quiet and unassuming life as a junior high school student alongside his friends Tsubaki Sawabe and Ryouta Watari. While struggling to get over his mother's death, he continues to cling to music. His monochrome life turns upside down the day he encounters the eccentric violinist Kaori Miyazono, who thrusts him back into the spotlight as her accompanist. Through a little lie, these two young musicians grow closer together as Kaori tries to fill Kousei's world with color.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 22,
    "status": "Finished Airing",
    "start_Aired": "Oct 10, 2014",
    "end_Aired": "Mar 20, 2015",
    "premiered": "Fall 2014",
    "broadcast": "Fridays at 0120 (JST)",
    "producers": "Aniplex, Dentsu, Kodansha, Fuji TV, Lawson HMV Entertainment, Kyoraku Industrial Holdings, Kansai Telecasting",
    "licensors": "Aniplex of America",
    "studios": "A-1 Pictures",
    "source": "Manga",
    "genres": "Drama, Romance",
    "themes": "Music, School",
    "demographics": "Shounen",
    "duration_Minutes": 22,
    "rating": "PG-13 - Teens 13 or older",
    "score": 8.661,
    "scored_Users": 224172,
    "ranked": 602,
    "popularity": 21,
    "members": 1989985,
    "favorites": 80730
  },
  {
    "id": 40748,
    "title": "Jujutsu Kaisen",
    "synonyms": "Sorcery Fight, JJK",
    "japanese": "呪術廻戦",
    "english": "Jujutsu Kaisen",
    "synopsis": "idly indulging in baseless paranormal activities with the Occult Club, high schooler Yuuji Itadori spends his days at either the clubroom or the hospital, where he visits his bedridden grandfather. However, this leisurely lifestyle soon takes a turn for the strange when he unknowingly encounters a cursed item. Triggering a chain of supernatural occurrences, Yuuji finds himself suddenly thrust into the world of Curses—dreadful beings formed from human malice and negativity—after swallowing the said item, revealed to be a finger belonging to the demon Sukuna Ryoumen, the King of Curses.Yuuji experiences first-hand the threat these Curses pose to society as he discovers his own newfound powers. Introduced to the Tokyo Metropolitan Jujutsu Technical High School, he begins to walk down a path from which he cannot return—the path of a Jujutsu sorcerer.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 24,
    "status": "Finished Airing",
    "start_Aired": "Oct 3, 2020",
    "end_Aired": "Mar 27, 2021",
    "premiered": "Fall 2020",
    "broadcast": "Saturdays at 0125 (JST)",
    "producers": "Mainichi broadcasting System, TOHO animation, Shueisha, dugout, Sumzap",
    "licensors": "Unknown",
    "studios": "MAPPA",
    "source": "Manga",
    "genres": "Action, Fantasy",
    "themes": "School",
    "demographics": "Shounen",
    "duration_Minutes": 23,
    "rating": "R - 17+ (violence & profanity)",
    "score": 8.671,
    "scored_Users": 291912,
    "ranked": 532,
    "popularity": 22,
    "members": 1982019,
    "favorites": 74093
  },
  {
    "id": 20507,
    "title": "Noragami",
    "synonyms": "Unknown",
    "japanese": "ノラガミ",
    "english": "Noragami",
    "synopsis": "In times of need, if you look in the right place, you just may see a strange telephone number scrawled in red. If you call this number, you will hear a young man introduce himself as the Yato God.Yato is a minor deity and a self-proclaimed Delivery God, who dreams of having millions of worshippers. Without a single shrine dedicated to his name, however, his goals are far from being realized. He spends his days doing odd jobs for five yen apiece, until his weapon partner becomes fed up with her useless master and deserts him.Just as things seem to be looking grim for the god, his fortune changes when a middle school girl, Hiyori Iki, supposedly saves Yato from a car accident, taking the hit for him. Remarkably, she survives, but the event has caused her soul to become loose and hence able to leave her body. Hiyori demands that Yato return her to normal, but upon learning that he needs a new partner to do so, reluctantly agrees to help him find one. And with Hiyori's help, Yato's luck may finally be turning around.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 12,
    "status": "Finished Airing",
    "start_Aired": "Jan 5, 2014",
    "end_Aired": "Mar 23, 2014",
    "premiered": "Winter 2014",
    "broadcast": "Sundays at 2330 (JST)",
    "producers": "Avex Entertainment, Dentsu, Shochiku, Kodansha, Movic, Ai Addiction, Lawson HMV Entertainment, A-Sketch",
    "licensors": "Funimation",
    "studios": "Bones",
    "source": "Manga",
    "genres": "Action, Fantasy",
    "themes": "Mythology",
    "demographics": "Shounen",
    "duration_Minutes": 24,
    "rating": "PG-13 - Teens 13 or older",
    "score": 7.961,
    "scored_Users": 176835,
    "ranked": 6162,
    "popularity": 23,
    "members": 1978778,
    "favorites": 31615
  },
  {
    "id": 31240,
    "title": "Re:Zero kara Hajimeru Isekai Seikatsu",
    "synonyms": "Re Life in a different world from zero, ReZero, ReZero",
    "japanese": "Re：ゼロから始める異世界生活",
    "english": "ReZERO -Starting Life in Another World-",
    "synopsis": "When Subaru Natsuki leaves the convenience store, the last thing he expects is to be wrenched from his everyday life and dropped into a fantasy world. Things are not looking good for the bewildered teenager; however, not long after his arrival, he is attacked by some thugs. Armed with only a bag of groceries and a now useless cell phone, he is quickly beaten to a pulp. Fortunately, a mysterious beauty named Satella, in hot pursuit after the one who stole her insignia, happens upon Subaru and saves him. In order to thank the honest and kindhearted girl, Subaru offers to help in her search, and later that night, he even finds the whereabouts of that which she seeks. But unbeknownst to them, a much darker force stalks the pair from the shadows, and just minutes after locating the insignia, Subaru and Satella are brutally murdered.However, Subaru immediately reawakens to a familiar scene—confronted by the same group of thugs, meeting Satella all over again—the enigma deepens as history inexplicably repeats itself.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 25,
    "status": "Finished Airing",
    "start_Aired": "Apr 4, 2016",
    "end_Aired": "Sep 19, 2016",
    "premiered": "Spring 2016",
    "broadcast": "Mondays at 0105 (JST)",
    "producers": "TV Tokyo, Media Factory, Kadokawa Shoten, AT-X, Magic Capsule, Memory-Tech, Hakuhodo DY Music & Pictures",
    "licensors": "Funimation",
    "studios": "White Fox",
    "source": "Light novel",
    "genres": "Drama, Fantasy, Suspense",
    "themes": "Isekai, Psychological, Time Travel",
    "demographics": "Unknown",
    "duration_Minutes": 25,
    "rating": "R - 17+ (violence & profanity)",
    "score": 8.241,
    "scored_Users": 281702,
    "ranked": 2922,
    "popularity": 24,
    "members": 1975711,
    "favorites": 62373
  },
  {
    "id": 21,
    "title": "One Piece",
    "synonyms": "OP",
    "japanese": "ONE PIECE",
    "english": "One Piece",
    "synopsis": "Gol D. Roger was known as the Pirate King, the strongest and most infamous being to have sailed the Grand Line. The capture and execution of Roger by the World Government brought a change throughout the world. His last words before his death revealed the existence of the greatest treasure in the world, One Piece. It was this revelation that brought about the Grand Age of Pirates, men who dreamed of finding One Piece—which promises an unlimited amount of riches and fame—and quite possibly the pinnacle of glory and the title of the Pirate King.Enter Monkey D. Luffy, a 17-year-old boy who defies your standard definition of a pirate. Rather than the popular persona of a wicked, hardened, toothless pirate ransacking villages for fun, Luffy's reason for being a pirate is one of pure wonder: the thought of an exciting adventure that leads him to intriguing people and ultimately, the promised treasure. Following in the footsteps of his childhood hero, Luffy and his crew travel across the Grand Line, experiencing crazy adventures, unveiling dark mysteries and battling strong enemies, all in order to reach the most coveted of all fortunes—One Piece.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": "",
    "status": "Currently Airing",
    "start_Aired": "Oct 20, 1999",
    "end_Aired": "Unknown",
    "premiered": "Fall 1999",
    "broadcast": "Sundays at 0930 (JST)",
    "producers": "Fuji TV, TAP, Shueisha",
    "licensors": "Funimation, 4Kids Entertainment",
    "studios": "Toei Animation",
    "source": "Manga",
    "genres": "Action, Adventure, Fantasy",
    "themes": "Unknown",
    "demographics": "Shounen",
    "duration_Minutes": 24,
    "rating": "PG-13 - Teens 13 or older",
    "score": 8.671,
    "scored_Users": 121979,
    "ranked": 582,
    "popularity": 25,
    "members": 1967217,
    "favorites": 177620
  },
  {
    "id": 36456,
    "title": "Boku no Hero Academia 3rd Season",
    "synonyms": "Unknown",
    "japanese": "僕のヒーローアカデミア",
    "english": "My Hero Academia Season 3",
    "synopsis": "As summer arrives for the students at UA Academy, each of these superheroes-in-training puts in their best efforts to become renowned heroes. They head off to a forest training camp run by UA's pro heroes, where the students face one another in battle and go through dangerous tests, improving their abilities and pushing past their limits. However, their school trip is suddenly turned upside down when the League of Villains arrives, invading the camp with a mission to capture one of the students. Boku no Hero Academia 3rd Season follows Izuku Deku Midoriya, an ambitious student training to achieve his dream of becoming a hero similar to his role model—All Might. Being one of the students caught up amidst the chaos of the villain attack, Deku must take a stand with his classmates and fight for their survival.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 25,
    "status": "Finished Airing",
    "start_Aired": "Apr 7, 2018",
    "end_Aired": "Sep 29, 2018",
    "premiered": "Spring 2018",
    "broadcast": "Saturdays at 1730 (JST)",
    "producers": "Dentsu, Yomiuri Telecasting, Movic, Sony Music Entertainment, TOHO animation, Shueisha",
    "licensors": "Funimation",
    "studios": "Bones",
    "source": "Manga",
    "genres": "Action",
    "themes": "School, Super Power",
    "demographics": "Shounen",
    "duration_Minutes": 23,
    "rating": "PG-13 - Teens 13 or older",
    "score": 8.071,
    "scored_Users": 295513,
    "ranked": 4742,
    "popularity": 26,
    "members": 1952185,
    "favorites": 12713
  },
  {
    "id": 6547,
    "title": "Angel Beats!",
    "synonyms": "Unknown",
    "japanese": "Angel Beats!（エンジェルビーツ!）",
    "english": "Angel Beats!",
    "synopsis": "Death is one of many mysteries that has left humanity in the dark since the dawn of time. However, the burning question of what happens to the soul after one dies is soon answered to 17-year-old Yuzuru Otonashi. Waking up with no previous memories in a dimension between life and death, he discovers the unsettling truth of the afterlife.  Taking the form of a high school, this bizarre dimension is designated to shelter those who died unwanted deaths. Feeling wronged by God during their earthly lives, the school's residents have decided to form the Afterlife Battlefront—a rebellious faction determined to oppose their god-like student council president, Kanade Angel Tachibana. The group's leader, Yuri Nakamura, recruits Otonashi in their fight against Angel in order to take control of their own lives. However, questioning the morality behind their actions, Otonashi takes a step behind the enemy lines to understand the opposing side of their common fate.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 13,
    "status": "Finished Airing",
    "start_Aired": "Apr 3, 2010",
    "end_Aired": "Jun 26, 2010",
    "premiered": "Spring 2010",
    "broadcast": "Unknown",
    "producers": "Aniplex, Dentsu, Mainichi broadcasting System, CBC Television, Movic, Visual Arts, ASCII Media Works",
    "licensors": "Sentai Filmworks, Aniplex of America",
    "studios": "P.A. Works",
    "source": "Original",
    "genres": "Drama, Supernatural",
    "themes": "School",
    "demographics": "Unknown",
    "duration_Minutes": 24,
    "rating": "PG-13 - Teens 13 or older",
    "score": 8.071,
    "scored_Users": 206933,
    "ranked": 4732,
    "popularity": 27,
    "members": 1935226,
    "favorites": 46669
  },
  {
    "id": 38524,
    "title": "Shingeki no Kyojin Season 3 Part 2",
    "synonyms": "Unknown",
    "japanese": "進撃の巨人 Season3 Part.2",
    "english": "Attack on Titan Season 3 Part 2",
    "synopsis": "Seeking to restore humanity's diminishing hope, the Survey Corps embark on a mission to retake Wall Maria, where the battle against the merciless Titans takes the stage once again.Returning to the tattered Shiganshina District that was once his home, Eren Yeager and the Corps find the town oddly unoccupied by Titans. Even after the outer gate is plugged, they strangely encounter no opposition. The mission progresses smoothly until Armin Arlert, highly suspicious of the enemy's absence, discovers distressing signs of a potential scheme against them. Shingeki no Kyojin Season 3 Part 2 follows Eren as he vows to take back everything that was once his. Alongside him, the Survey Corps strive—through countless sacrifices—to carve a path towards victory and uncover the secrets locked away in the Yeager family's basement.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 10,
    "status": "Finished Airing",
    "start_Aired": "Apr 29, 2019",
    "end_Aired": "Jul 1, 2019",
    "premiered": "Spring 2019",
    "broadcast": "Mondays at 0010 (JST)",
    "producers": "Production I.G, Dentsu, Mainichi broadcasting System, Pony Canyon, Kodansha, Techno Sound, Pony Canyon Enterprise",
    "licensors": "Funimation",
    "studios": "Wit Studio",
    "source": "Manga",
    "genres": "Action, Drama",
    "themes": "Gore, Military, Survival",
    "demographics": "Shounen",
    "duration_Minutes": 23,
    "rating": "R - 17+ (violence & profanity)",
    "score": 9.071,
    "scored_Users": 357688,
    "ranked": 52,
    "popularity": 28,
    "members": 1922805,
    "favorites": 52595
  },
  {
    "id": 22199,
    "title": "Akame ga Kill!",
    "synonyms": "Akame ga Kiru!",
    "japanese": "アカメが斬る！",
    "english": "Akame ga Kill!",
    "synopsis": "Night Raid is the covert assassination branch of the Revolutionary Army, an uprising assembled to overthrow Prime Minister Honest, whose avarice and greed for power has led him to take advantage of the child emperor's inexperience. Without a strong and benevolent leader, the rest of the nation is left to drown in poverty, strife, and ruin. Though the Night Raid members are all experienced killers, they understand that taking lives is far from commendable and that they will likely face retribution as they mercilessly eliminate anyone who stands in the revolution's way.This merry band of assassins' newest member is Tatsumi, a naïve boy from a remote village who had embarked on a journey to help his impoverished hometown and was won over by not only Night Raid's ideals, but also their resolve. Akame ga Kill! follows Tatsumi as he fights the Empire and comes face-to-face with powerful weapons, enemy assassins, challenges to his own morals and values, and ultimately, what it truly means to be an assassin with a cause.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 24,
    "status": "Finished Airing",
    "start_Aired": "Jul 7, 2014",
    "end_Aired": "Dec 15, 2014",
    "premiered": "Summer 2014",
    "broadcast": "Mondays at 0000 (JST)",
    "producers": "Square Enix, TOHO animation",
    "licensors": "Sentai Filmworks",
    "studios": "White Fox",
    "source": "Manga",
    "genres": "Action, Fantasy",
    "themes": "Gore, Super Power",
    "demographics": "Shounen",
    "duration_Minutes": 23,
    "rating": "R - 17+ (violence & profanity)",
    "score": 7.471,
    "scored_Users": 196941,
    "ranked": 17692,
    "popularity": 29,
    "members": 1891216,
    "favorites": 26892
  },
  {
    "id": 31043,
    "title": "Boku dake ga Inai Machi",
    "synonyms": "The Town Where Only I am Missing, BokuMachi",
    "japanese": "僕だけがいない街",
    "english": "ERASED",
    "synopsis": "When tragedy is about to strike, Satoru Fujinuma finds himself sent back several minutes before the accident occurs. The detached, 29-year-old manga artist has taken advantage of this powerful yet mysterious phenomenon, which he calls Revival, to save many lives.However, when he is wrongfully accused of murdering someone close to him, Satoru is sent back to the past once again, but this time to 1988, 18 years in the past. Soon, he realizes that the murder may be connected to the abduction and killing of one of his classmates, the solitary and mysterious Kayo Hinazuki, that took place when he was a child. This is his chance to make things right.Boku dake ga Inai Machi follows Satoru in his mission to uncover what truly transpired 18 years ago and prevent the death of his classmate while protecting those he cares about in the present.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 12,
    "status": "Finished Airing",
    "start_Aired": "Jan 8, 2016",
    "end_Aired": "Mar 25, 2016",
    "premiered": "Winter 2016",
    "broadcast": "Fridays at 0055 (JST)",
    "producers": "Aniplex, Dentsu, Kadokawa Shoten, Fuji TV, DAX Production, Kyoraku Industrial Holdings, Kansai Telecasting, Lawson, Kanetsu Investment, C-one",
    "licensors": "Aniplex of America",
    "studios": "A-1 Pictures",
    "source": "Manga",
    "genres": "Mystery",
    "themes": "Psychological, Time Travel",
    "demographics": "Seinen",
    "duration_Minutes": 23,
    "rating": "R - 17+ (violence & profanity)",
    "score": 8.311,
    "scored_Users": 232902,
    "ranked": 2262,
    "popularity": 30,
    "members": 1879761,
    "favorites": 44620
  }  
  ]