[
  {
    "id": 16498,
    "title": "Shingeki no Kyojin",
    "synonyms": "AoT, SnK",
    "japanese": "進撃の巨人",
    "english": "Attack on Titan",
    "synopsis": "Centuries ago, mankind was slaughtered to near extinction by monstrous humanoid creatures called Titans, forcing humans to hide in fear behind enormous concentric walls. What makes these giants truly terrifying is that their taste for human flesh is not born out of hunger but what appears to be out of pleasure. To ensure their survival, the remnants of humanity began living within defensive barriers, resulting in one hundred years without a single titan encounter. However, that fragile calm is soon shattered when a colossal Titan manages to breach the supposedly impregnable outer wall, reigniting the fight for survival against the man-eating abominations. After witnessing a horrific personal loss at the hands of the invading creatures, Eren Yeager dedicates his life to their eradication by enlisting into the Survey Corps, an elite military unit that combats the merciless humanoids outside the protection of the walls. Eren, his adopted sister Mikasa Ackerman, and his childhood friend Armin Arlert join the brutal war against the Titans and race to discover a way of defeating them before the last walls are breached. [Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 25,
    "status": "Finished Airing",
    "start_Aired": "Apr 7, 2013",
    "end_Aired": "Sep 29, 2013",
    "premiered": "Spring 2013",
    "broadcast": "Sundays at 0158 (JST)",
    "producers": "Production I.G, Dentsu, Mainichi broadcasting System, Pony Canyon, Kodansha, Mad Box, Pony Canyon Enterprise",
    "licensors": "Funimation",
    "studios": "Wit Studio",
    "source": "Manga",
    "genres": "Action, Drama",
    "themes": "Gore, Military, Survival",
    "demographics": "Shounen",
    "duration_Minutes": 24,
    "rating": "R - 17+ (violence & profanity)",
    "score": 8.531,
    "scored_Users": 519803,
    "ranked": 1002,
    "popularity": 1,
    "members": 3524109,
    "favorites": 155695
  },
  {
    "id": 1535,
    "title": "Death Note",
    "synonyms": "DN",
    "japanese": "デスノート",
    "english": "Death Note",
    "synopsis": "Brutal murders, petty thefts, and senseless violence pollute the human world. In contrast, the realm of death gods is a humdrum, unchanging gambling den. The ingenious 17-year-old japanese student Light Yagami and sadistic god of death Ryuk share one belief: their worlds are rotten.For his own amusement, Ryuk drops his Death Note into the human world. Light stumbles upon it, deeming the first of its rules ridiculous: the human whose name is written in this note shall die. However, the temptation is too great, and Light experiments by writing a felon's name, which disturbingly enacts his first murder.Aware of the terrifying godlike power that has fallen into his hands, Light—under the alias Kira—follows his wicked sense of justice with the ultimate goal of cleansing the world of all evil-doers. The meticulous mastermind detective L is already on his trail, but as Light's brilliance rivals L's, the grand chase for Kira turns into an intense battle of wits that can only end when one of them is dead.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 37,
    "status": "Finished Airing",
    "start_Aired": "Oct 4, 2006",
    "end_Aired": "Jun 27, 2007",
    "premiered": "Fall 2006",
    "broadcast": "Wednesdays at 0056 (JST)",
    "producers": "VAP, Konami, Ashi Productions, Nippon Television Network, Shueisha",
    "licensors": "VIZ Media",
    "studios": "Madhouse",
    "source": "Manga",
    "genres": "Supernatural, Suspense",
    "themes": "Psychological",
    "demographics": "Shounen",
    "duration_Minutes": 23,
    "rating": "R - 17+ (violence & profanity)",
    "score": 8.621,
    "scored_Users": 485487,
    "ranked": 732,
    "popularity": 2,
    "members": 3504535,
    "favorites": 159701
  },
  {
    "id": 5114,
    "title": "Fullmetal Alchemist: Brotherhood",
    "synonyms": "Hagane no Renkinjutsushi Fullmetal Alchemist, Fullmetal Alchemist (2009), FMA, FMAB",
    "japanese": "鋼の錬金術師 FULLMETAL ALCHEMIST",
    "english": "Fullmetal Alchemist Brotherhood",
    "synopsis": "After a horrific alchemy experiment goes wrong in the Elric household, brothers Edward and Alphonse are left in a catastrophic new reality. Ignoring the alchemical principle banning human transmutation, the boys attempted to bring their recently deceased mother back to life. Instead, they suffered brutal personal loss: Alphonse's body disintegrated while Edward lost a leg and then sacrificed an arm to keep Alphonse's soul in the physical realm by binding it to a hulking suit of armor.The brothers are rescued by their neighbor Pinako Rockbell and her granddaughter Winry. Known as a bio-mechanical engineering prodigy, Winry creates prosthetic limbs for Edward by utilizing automail, a tough, versatile metal used in robots and combat armor. After years of training, the Elric brothers set off on a quest to restore their bodies by locating the Philosopher's Stone—a powerful gem that allows an alchemist to defy the traditional laws of Equivalent Exchange.As Edward becomes an infamous alchemist and gains the nickname Fullmetal, the boys' journey embroils them in a growing conspiracy that threatens the fate of the world.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 64,
    "status": "Finished Airing",
    "start_Aired": "Apr 5, 2009",
    "end_Aired": "Jul 4, 2010",
    "premiered": "Spring 2009",
    "broadcast": "Sundays at 1700 (JST)",
    "producers": "Aniplex, Square Enix, Mainichi broadcasting System, Studio Moriken",
    "licensors": "Funimation, Aniplex of America",
    "studios": "Bones",
    "source": "Manga",
    "genres": "Action, Adventure, Drama, Fantasy",
    "themes": "Military",
    "demographics": "Shounen",
    "duration_Minutes": 24,
    "rating": "R - 17+ (violence & profanity)",
    "score": 9.131,
    "scored_Users": 900398,
    "ranked": 12,
    "popularity": 3,
    "members": 2978455,
    "favorites": 207772
  },
  {
    "id": 30276,
    "title": "One Punch Man",
    "synonyms": "One Punch-Man, One-Punch Man, OPM",
    "japanese": "ワンパンマン",
    "english": "One Punch Man",
    "synopsis": "The seemingly unimpressive Saitama has a rather unique hobby: being a hero. In order to pursue his childhood dream, Saitama relentlessly trained for three years, losing all of his hair in the process. Now, Saitama is so powerful, he can defeat any enemy with just one punch. However, having no one capable of matching his strength has led Saitama to an unexpected problem—he is no longer able to enjoy the thrill of battling and has become quite bored.One day, Saitama catches the attention of 19-year-old cyborg Genos, who witnesses his power and wishes to become Saitama's disciple. Genos proposes that the two join the Hero Association in order to become certified heroes that will be recognized for their positive contributions to society. Saitama, who is shocked that no one knows who he is, quickly agrees. Meeting new allies and taking on new foes, Saitama embarks on a new journey as a member of the Hero Association to experience the excitement of battle he once felt.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 12,
    "status": "Finished Airing",
    "start_Aired": "Oct 5, 2015",
    "end_Aired": "Dec 21, 2015",
    "premiered": "Fall 2015",
    "broadcast": "Mondays at 0105 (JST)",
    "producers": "TV Tokyo, Bandai Visual, Lantis, Asatsu DK, Banpresto, Good Smile Company, Shueisha, JR East Marketing & Communications",
    "licensors": "VIZ Media",
    "studios": "Madhouse",
    "source": "Web manga",
    "genres": "Action, Comedy",
    "themes": "Parody, Super Power",
    "demographics": "Seinen",
    "duration_Minutes": 24,
    "rating": "R - 17+ (violence & profanity)",
    "score": 8.511,
    "scored_Users": 19066,
    "ranked": 1112,
    "popularity": 4,
    "members": 2879907,
    "favorites": 59651
  },
  {
    "id": 11757,
    "title": "Sword Art Online",
    "synonyms": "S.A.O, SAO",
    "japanese": "ソードアート・オンライン",
    "english": "Sword Art Online",
    "synopsis": "Ever since the release of the innovative NerveGear, gamers from all around the globe have been given the opportunity to experience a completely immersive virtual reality. Sword Art Online (SAO), one of the most recent games on the console, offers a gateway into the wondrous world of Aincrad, a vivid, medieval landscape where users can do anything within the limits of imagination. With the release of this worldwide sensation, gaming has never felt more lifelike.However, the idyllic fantasy rapidly becomes a brutal nightmare when SAO's creator traps thousands of players inside the game. The log-out function has been removed, with the only method of escape involving beating all of Aincrad's one hundred increasingly difficult levels. Adding to the struggle, any in-game death becomes permanent, ending the player's life in the real world.While Kazuto Kirito Kirigaya was fortunate enough to be a beta-tester for the game, he quickly finds that despite his advantages, he cannot overcome SAO's challenges alone. Teaming up with Asuna Yuuki and other talented players, Kirito makes an effort to face the seemingly insurmountable trials head-on. But with difficult bosses and threatening dark cults impeding his progress, Kirito finds that such tasks are much easier said than done.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 25,
    "status": "Finished Airing",
    "start_Aired": "Jul 8, 2012",
    "end_Aired": "Dec 23, 2012",
    "premiered": "Summer 2012",
    "broadcast": "Sundays at 0000 (JST)",
    "producers": "Aniplex, Genco, DAX Production, ASCII Media Works, Bandai Namco Games",
    "licensors": "Aniplex of America",
    "studios": "A-1 Pictures",
    "source": "Light novel",
    "genres": "Action, Adventure, Fantasy, Romance",
    "themes": "Love Polygon, Video Game",
    "demographics": "Unknown",
    "duration_Minutes": 23,
    "rating": "PG-13 - Teens 13 or older",
    "score": 7.201,
    "scored_Users": 990254,
    "ranked": 29562,
    "popularity": 5,
    "members": 2813565,
    "favorites": 64997
  },
  {
    "id": 31964,
    "title": "Boku no Hero Academia",
    "synonyms": "Unknown",
    "japanese": "僕のヒーローアカデミア",
    "english": "My Hero Academia",
    "synopsis": "The appearance of quirks, newly discovered super powers, has been steadily increasing over the years, with 80 percent of humanity possessing various abilities from manipulation of elements to shapeshifting. This leaves the remainder of the world completely powerless, and Izuku Midoriya is one such individual.Since he was a child, the ambitious middle schooler has wanted nothing more than to be a hero. Izuku's unfair fate leaves him admiring heroes and taking notes on them whenever he can. But it seems that his persistence has borne some fruit: Izuku meets the number one hero and his personal idol, All Might. All Might's quirk is a unique ability that can be inherited, and he has chosen Izuku to be his successor!Enduring many months of grueling training, Izuku enrolls in UA High, a prestigious high school famous for its excellent hero training program, and this year's freshmen look especially promising. With his bizarre but talented classmates and the looming threat of a villainous organization, Izuku will soon learn what it really means to be a hero.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 13,
    "status": "Finished Airing",
    "start_Aired": "Apr 3, 2016",
    "end_Aired": "Jun 26, 2016",
    "premiered": "Spring 2016",
    "broadcast": "Sundays at 1700 (JST)",
    "producers": "Dentsu, Mainichi broadcasting System, Movic, TOHO animation, Shueisha",
    "licensors": "Funimation",
    "studios": "Bones",
    "source": "Manga",
    "genres": "Action",
    "themes": "School, Super Power",
    "demographics": "Shounen",
    "duration_Minutes": 24,
    "rating": "PG-13 - Teens 13 or older",
    "score": 7.921,
    "scored_Users": 871325,
    "ranked": 6722,
    "popularity": 6,
    "members": 2708684,
    "favorites": 52169
  },
  {
    "id": 20,
    "title": "Naruto",
    "synonyms": "NARUTO",
    "japanese": "ナルト",
    "english": "Naruto",
    "synopsis": "Moments prior to Naruto Uzumaki's birth, a huge demon known as the Kyuubi, the Nine-Tailed Fox, attacked Konohagakure, the Hidden Leaf Village, and wreaked havoc. In order to put an end to the Kyuubi's rampage, the leader of the village, the Fourth Hokage, sacrificed his life and sealed the monstrous beast inside the newborn Naruto.Now, Naruto is a hyperactive and knuckle-headed ninja still living in Konohagakure. Shunned because of the Kyuubi inside him, Naruto struggles to find his place in the village, while his burning desire to become the Hokage of Konohagakure leads him not only to some great new friends, but also some deadly foes.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 220,
    "status": "Finished Airing",
    "start_Aired": "Oct 3, 2002",
    "end_Aired": "Feb 8, 2007",
    "premiered": "Fall 2002",
    "broadcast": "Thursdays at 1930 (JST)",
    "producers": "TV Tokyo, Aniplex, Shueisha",
    "licensors": "VIZ Media",
    "studios": "Pierrot",
    "source": "Manga",
    "genres": "Action, Adventure, Fantasy",
    "themes": "Martial Arts",
    "demographics": "Shounen",
    "duration_Minutes": 23,
    "rating": "PG-13 - Teens 13 or older",
    "score": 7.971,
    "scored_Users": 784527,
    "ranked": 5982,
    "popularity": 7,
    "members": 2557342,
    "favorites": 71876
  },
  {
    "id": 22319,
    "title": "Tokyo Ghoul",
    "synonyms": "Tokyo Kushu, Toukyou Kushu, Toukyou Ghoul",
    "japanese": "東京喰種-トーキョーグール-",
    "english": "Tokyo Ghoul",
    "synopsis": "A sinister threat is invading Tokyo: flesh-eating ghouls who appear identical to humans and blend into their population. Reserved college student Ken Kaneki buries his nose in books and avoids the news of the growing crisis. However, the appearance of an attractive woman named Rize Kamishiro shatters his solitude when she forwardly asks him on a date.While walking Rize home, Kaneki discovers she isn't as kind as she first appeared, and she has led him on with sinister intent. After a tragic struggle, he later awakens in a hospital to learn his life was saved by transplanting the now deceased Rize's organs into his own body. Kaneki's body begins to change in horrifying ways, and he transforms into a human-ghoul hybrid. As he embarks on his new dreadful journey, Kaneki clings to his humanity in the evolving bloody conflict between society's new monsters and the government agents who hunt them.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 12,
    "status": "Finished Airing",
    "start_Aired": "Jul 4, 2014",
    "end_Aired": "Sep 19, 2014",
    "premiered": "Summer 2014",
    "broadcast": "Fridays at 0000 (JST)",
    "producers": "Marvelous AQL, TC Entertainment, Shueisha",
    "licensors": "Funimation",
    "studios": "Pierrot",
    "source": "Manga",
    "genres": "Action, Fantasy, Horror",
    "themes": "Gore, Psychological",
    "demographics": "Seinen",
    "duration_Minutes": 24,
    "rating": "R - 17+ (violence & profanity)",
    "score": 7.791,
    "scored_Users": 708575,
    "ranked": 9082,
    "popularity": 8,
    "members": 2556441,
    "favorites": 47433
  },
  {
    "id": 199,
    "title": "Sen to Chihiro no Kamikakushi",
    "synonyms": "Sen and Chihiro's Spiriting Away",
    "japanese": "千と千尋の神隠し",
    "english": "Spirited Away",
    "synopsis": "Stubborn, spoiled, and naïve, 10-year-old Chihiro Ogino is less than pleased when she and her parents discover an abandoned amusement park on the way to their new house. Cautiously venturing inside, she realizes that there is more to this place than meets the eye, as strange things begin to happen once dusk falls. Ghostly apparitions and food that turns her parents into pigs are just the start—Chihiro has unwittingly crossed over into the spirit world. Now trapped, she must summon the courage to live and work amongst spirits, with the help of the enigmatic Haku and the cast of unique characters she meets along the way.Vivid and intriguing, Sen to Chihiro no Kamikakushi tells the story of Chihiro's journey through an unfamiliar world as she strives to save her parents and return home.[Written by MAL Rewrite]",
    "type": "Movie",
    "episodes": 1,
    "status": "Finished Airing",
    "start_Aired": "Jul 20, 2001",
    "end_Aired": "Not Available",
    "premiered": "Unknown",
    "broadcast": "Unknown",
    "producers": "Toho",
    "licensors": "Disney Platform Distribution, GKidS",
    "studios": "Studio Ghibli",
    "source": "Original",
    "genres": "Adventure, Award Winning, Supernatural",
    "themes": "Mythology",
    "demographics": "Unknown",
    "duration_Minutes": 124,
    "rating": "PG - Children",
    "score": 8.781,
    "scored_Users": 166603,
    "ranked": 342,
    "popularity": 9,
    "members": 1657524,
    "favorites": 29322
  },
  {
    "id": 11061,
    "title": "Hunter x Hunter (2011)",
    "synonyms": "HxH (2011)",
    "japanese": "HUNTER×HUNTER（ハンター×ハンター）",
    "english": "Hunter x Hunter",
    "synopsis": "Hunters devote themselves to accomplishing hazardous tasks, all from traversing the world's uncharted territories to locating rare items and monsters. Before becoming a Hunter, one must pass the Hunter Examination—a high-risk selection process in which most applicants end up handicapped or worse, deceased.Ambitious participants who challenge the notorious exam carry their own reason. What drives 12-year-old Gon Freecss is finding Ging, his father and a Hunter himself. Believing that he will meet his father by becoming a Hunter, Gon takes the first step to walk the same path.During the Hunter Examination, Gon befriends the medical student Leorio Paladiknight, the vindictive Kurapika, and ex-assassin Killua Zoldyck. While their motives vastly differ from each other, they band together for a common goal and begin to venture into a perilous world.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 148,
    "status": "Finished Airing",
    "start_Aired": "Oct 2, 2011",
    "end_Aired": "Sep 24, 2014",
    "premiered": "Fall 2011",
    "broadcast": "Sundays at 1055 (JST)",
    "producers": "VAP, Nippon Television Network, Shueisha",
    "licensors": "VIZ Media",
    "studios": "Madhouse",
    "source": "Manga",
    "genres": "Action, Adventure, Fantasy",
    "themes": "Unknown",
    "demographics": "Shounen",
    "duration_Minutes": 23,
    "rating": "PG-13 - Teens 13 or older",
    "score": 9.041,
    "scored_Users": 538454,
    "ranked": 92,
    "popularity": 10,
    "members": 2464157,
    "favorites": 188649
  },
  {
    "id": 32281,
    "title": "Kimi no Na wa.",
    "synonyms": "Unknown",
    "japanese": "君の名は。",
    "english": "Your Name.",
    "synopsis": "Mitsuha Miyamizu, a high school girl, yearns to live the life of a boy in the bustling city of Tokyo—a dream that stands in stark contrast to her present life in the countryside. Meanwhile in the city, Taki Tachibana lives a busy life as a high school student while juggling his part-time job and hopes for a future in architecture.One day, Mitsuha awakens in a room that is not her own and suddenly finds herself living the dream life in Tokyo—but in Taki's body! Elsewhere, Taki finds himself living Mitsuha's life in the humble countryside. In pursuit of an answer to this strange phenomenon, they begin to search for one another.Kimi no Na wa. revolves around Mitsuha and Taki's actions, which begin to have a dramatic impact on each other's lives, weaving them into a fabric held together by fate and circumstance.[Written by MAL Rewrite]",
    "type": "Movie",
    "episodes": 1,
    "status": "Finished Airing",
    "start_Aired": "Aug 26, 2016",
    "end_Aired": "Not Available",
    "premiered": "Unknown",
    "broadcast": "Unknown",
    "producers": "Toho, Sound Team Don Juan, Amuse, JR East Marketing & Communications, Kadokawa, voque ting",
    "licensors": "Funimation, NYAV Post",
    "studios": "CoMix Wave Films",
    "source": "Original",
    "genres": "Drama, Supernatural",
    "themes": "Romantic Subtext",
    "demographics": "Unknown",
    "duration_Minutes": 106,
    "rating": "PG-13 - Teens 13 or older",
    "score": 8.861,
    "scored_Users": 701857,
    "ranked": 222,
    "popularity": 11,
    "members": 2429958,
    "favorites": 83505
  },
  {
    "id": 33988,
    "title": "Demi-chan wa Kataritai",
    "synonyms": "Ajin-chan wa Kataritai",
    "japanese": "亜人ちゃんは語りたい",
    "english": "Interviews With Monster Girls",
    "synopsis": "High school biology teacher Tetsuo Takahashi may look like your average everyday instructor, but beneath his gentle appearance lies something less ordinary: his fascination for the Ajin, more commonly known as Demi. Although these half-human, half-monster beings have integrated into human society, Takahashi believes that much about them will remain unknown unless he interacts with them firsthand.Demi-chan wa Kataritai follows Takahashi's daily life in Shibasaki High School together with his three Demi students—Hikari Takanashi, an energetic vampire; Kyouko Machi, a gentle dullahan; and Yuki Kusakabe, the shy snow woman. Along the way, Takahashi also meets fellow teacher Sakie Satou, a succubus with an aversion towards men. To fulfill his goal of learning more about the Demi, Takahashi decides to conduct casual interviews with the girls to learn more about their abilities, psyche, and interaction with human society. As Takahashi strengthens his bond with his students, he soon discovers that the Demi are not as unusual as he initially believed.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 12,
    "status": "Finished Airing",
    "start_Aired": "Jan 8, 2017",
    "end_Aired": "Mar 26, 2017",
    "premiered": "Winter 2017",
    "broadcast": "Sundays at 0000 (JST)",
    "producers": "Aniplex, Kodansha, Kanetsu Investment, Christmas Holly",
    "licensors": "Funimation, Crunchyroll",
    "studios": "A-1 Pictures",
    "source": "Manga",
    "genres": "Comedy, Fantasy",
    "themes": "School, Vampire",
    "demographics": "Seinen",
    "duration_Minutes": 23,
    "rating": "PG-13 - Teens 13 or older",
    "score": 7.561,
    "scored_Users": 202741,
    "ranked": 14702,
    "popularity": 12,
    "members": 386806,
    "favorites": 1454
  },
  {
    "id": 9253,
    "title": "Steins;Gate",
    "synonyms": "Unknown",
    "japanese": "STEINS;GATE",
    "english": "Steins;Gate",
    "synopsis": "Eccentric scientist Rintarou Okabe has a never-ending thirst for scientific exploration. Together with his ditzy but well-meaning friend Mayuri Shiina and his roommate Itaru Hashida, Rintarou founds the Future Gadget Laboratory in the hopes of creating technological innovations that baffle the human psyche. Despite claims of grandeur, the only notable gadget the trio have created is a microwave that has the mystifying power to turn bananas into green goo.However, when Rintarou decides to attend neuroscientist Kurisu Makise's conference on time travel, he experiences a series of strange events that lead him to believe that there is more to the Phone Microwave gadget than meets the eye. Apparently able to send text messages into the past using the microwave, Rintarou dabbles further with the time machine, attracting the ire and attention of the mysterious organization SERN.Due to the novel discovery, Rintarou and his friends find themselves in an ever-present danger. As he works to mitigate the damage his invention has caused to the timeline, he is not only fighting a battle to save his loved ones, but also one against his degrading sanity.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 24,
    "status": "Finished Airing",
    "start_Aired": "Apr 6, 2011",
    "end_Aired": "Sep 14, 2011",
    "premiered": "Spring 2011",
    "broadcast": "Wednesdays at 0205 (JST)",
    "producers": "Frontier Works, Media Factory, Movic, AT-X, Kadokawa Pictures Japan, Nitroplus",
    "licensors": "Funimation",
    "studios": "White Fox",
    "source": "Visual novel",
    "genres": "Drama, Sci-Fi, Suspense",
    "themes": "Psychological, Time Travel",
    "demographics": "Unknown",
    "duration_Minutes": 24,
    "rating": "PG-13 - Teens 13 or older",
    "score": 9.081,
    "scored_Users": 268716,
    "ranked": 42,
    "popularity": 13,
    "members": 2299690,
    "favorites": 175248
  },
  {
    "id": 44511,
      "title": "Chainsaw Man",
      "synonyms": "Chainsaw Man",
      "japanese": "チェンソーマン",
      "english": "Chainsaw Man",
      "synopsis": "Denji has a simple dream—to live a happy and peaceful life, spending time with a girl he likes. This is a far cry from reality, however, as Denji is forced by the yakuza into killing devils in order to pay off his crushing debts. Using his pet devil Pochita as a weapon, he is ready to do anything for a bit of cash.Unfortunately, he has outlived his usefulness and is murdered by a devil in contract with the yakuza. However, in an unexpected turn of events, Pochita merges with Denji's dead body and grants him the powers of a chainsaw devil. Now able to transform parts of his body into chainsaws, a revived Denji uses his new abilities to quickly and brutally dispatch his enemies. Catching the eye of the official devil hunters who arrive at the scene, he is offered work at the Public Safety Bureau as one of them. Now with the means to face even the toughest of enemies, Denji will stop at nothing to achieve his simple teenage dreams.[Written by MAL Rewrite]",
      "type": "TV",
      "episodes": "12",
      "status": "Currently Airing",
      "start_Aired": "Oct 12, 2022",
      "end_Aired": "Unknown",
      "premiered": "Fall 2022",
      "broadcast": "Wednesdays at 0000 (JST)",
      "producers": "Unknown",
      "licensors": "Unknown",
      "studios": "MAPPA",
      "source": "Manga",
      "genres": "Action, Adventure",
      "themes": "Gore",
      "demographics": "Shounen",
      "duration_Minutes": 24,
      "rating": "R - 17+ (violence & profanity)",
      "score": 8.84,
      "scored_Users": 159151,
      "ranked": "25",
      "popularity": 14,
      "members": 509913,
      "favorites": 14181
  },
  {
    "id": 42894,
    "title": "Natsume Yuujinchou: Ishi Okoshi to Ayashiki Raihousha",
    "synonyms": "Unknown",
    "japanese": "夏目友人帳 石起こしと怪しき来訪者",
    "english": "Natsume's Book of Friends The Waking Rock and the Strange Visitor",
    "synopsis": "Ishi Okoshi. While searching for Nyanko-sensei, Takashi Natsume encounters meek and small-looking youkai Mitsumi. Mitsumi was entrusted by his leader Gantetsu, a powerful and strong ayakashi, to be the year's Ishi Okoshi, whose role consists of waking him from his deep slumber. Seeing how much Mitsumi wants to prove himself as Gantetsu's worthy servant, Natsume decides to help him fulfill his task. However, time is running out—for they are not the only ones who want to awaken the divine being.Ayashiki Raihousha. One day, Natsume's friend Kaname Tanuma is visited by a strange man. In the subsequent days, the visitor briefly talks with Tanuma and leaves. Natsume soon discovers that the outsider is a youkai disguised as a human, who claims to bear no danger. Despite trusting the youkai, Tanuma's health slowly begins to deteriorate, causing Natsume to become more suspicious of the interloper. What is the truth of his sudden appearance and his connection with Tanuma?[Written by MAL Rewrite]",
    "type": "Movie",
    "episodes": 1,
    "status": "Finished Airing",
    "start_Aired": "Jan 16, 2021",
    "end_Aired": "Not Available",
    "premiered": "Unknown",
    "broadcast": "Unknown",
    "producers": "Aniplex",
    "licensors": "Unknown",
    "studios": "Shuka",
    "source": "Manga",
    "genres": "Drama, Slice of Life, Supernatural",
    "themes": "Iyashikei, Mythology",
    "demographics": "Shoujo",
    "duration_Minutes": 51,
    "rating": "PG-13 - Teens 13 or older",
    "score": 8.131,
    "scored_Users": 7458,
    "ranked": 4012,
    "popularity": 15,
    "members": 29085,
    "favorites": 94
  },
  {
    "id": 1735,
    "title": "Naruto: Shippuuden",
    "synonyms": "Naruto Hurricane Chronicles",
    "japanese": "ナルト- 疾風伝",
    "english": "Naruto Shippuuden",
    "synopsis": "It has been two and a half years since Naruto Uzumaki left Konohagakure, the Hidden Leaf Village, for intense training following events which fueled his desire to be stronger. Now Akatsuki, the mysterious organization of elite rogue ninja, is closing in on their grand plan which may threaten the safety of the entire shinobi world.Although Naruto is older and sinister events loom on the horizon, he has changed little in personality—still rambunctious and childish—though he is now far more confident and possesses an even greater determination to protect his friends and home. Come whatever may, Naruto will carry on with the fight for what is important to him, even at the expense of his own body, in the continuation of the saga about the boy who wishes to become Hokage.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 500,
    "status": "Finished Airing",
    "start_Aired": "Feb 15, 2007",
    "end_Aired": "Mar 23, 2017",
    "premiered": "Winter 2007",
    "broadcast": "Thursdays at 1930 (JST)",
    "producers": "TV Tokyo, Aniplex, KSS, Rakuonsha, TV Tokyo Music, Shueisha",
    "licensors": "VIZ Media",
    "studios": "Pierrot",
    "source": "Manga",
    "genres": "Action, Adventure, Fantasy",
    "themes": "Martial Arts",
    "demographics": "Shounen",
    "duration_Minutes": 23,
    "rating": "PG-13 - Teens 13 or older",
    "score": 8.241,
    "scored_Users": 470641,
    "ranked": 2892,
    "popularity": 16,
    "members": 2188005,
    "favorites": 100796
  },
  {
    "id": 28,
    "title": "Yakitate!! Japan",
    "synonyms": "Freshly Baked!! Ja-pan!",
    "japanese": "焼きたて!! ジャぱん",
    "english": "Yakitate!! Japan",
    "synopsis": "While countries such as France, England, and Germany all have their own internationally celebrated bread, Japan simply does not have one that can match in reputation.Thus after discovering the wonders of breadmaking at a young age, Kazuma Azuma embarks on a quest to create Japan's own unique national bread. And being blessed with unusually warm hands that allow dough to ferment faster, Azuma is able to bring his baking innovations to another level.As he begins working at the prestigious japanese bakery chain, Pantasia, Azuma encounters other talented bakers and experiences firsthand the competitive world of baking. Along with his newfound friends and rivals, Azuma strives to create new and unparalleled bread that will start a baking revolution. [Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 69,
    "status": "Finished Airing",
    "start_Aired": "Oct 12, 2004",
    "end_Aired": "Mar 14, 2006",
    "premiered": "Fall 2004",
    "broadcast": "Unknown",
    "producers": "TV Tokyo, Aniplex, d-rights, Tohokushinsha Film Corporation, Atelier Musa",
    "licensors": "Nozomi Entertainment",
    "studios": "Sunrise",
    "source": "Manga",
    "genres": "Comedy, Gourmet",
    "themes": "Unknown",
    "demographics": "Shounen",
    "duration_Minutes": 24,
    "rating": "PG-13 - Teens 13 or older",
    "score": 7.921,
    "scored_Users": 39514,
    "ranked": 6712,
    "popularity": 17,
    "members": 92242,
    "favorites": 869
  },
  {
    "id": 12355,
    "title": "Ookami Kodomo no Ame to Yuki",
    "synonyms": "The Wolf Children Ame and Yuki",
    "japanese": "おおかみこどもの雨と雪",
    "english": "Wolf Children",
    "synopsis": "Hana, a hard-working college student, falls in love with a mysterious man who attends one of her classes though he is not an actual student. As it turns out, he is not truly human either. On a full moon night, he transforms, revealing that he is the last werewolf alive. Despite this, Hana's love remains strong, and the two ultimately decide to start a family.Hana gives birth to two healthy children—Ame, born during rainfall, and Yuki, born during snowfall—both possessing the ability to turn into wolves, a trait inherited from their father. All too soon, however, the sudden death of her lover devastates Hana's life, leaving her to raise a peculiar family completely on her own. The stress of raising her wild-natured children in a densely populated city, all while keeping their identity a secret, culminates in a decision to move to the countryside, where she hopes Ame and Yuki can live a life free from the judgments of society. Wolf Children is the heartwarming story about the challenges of being a single mother in an unforgiving modern world.[Written by MAL Rewrite]",
    "type": "Movie",
    "episodes": 1,
    "status": "Finished Airing",
    "start_Aired": "Jul 21, 2012",
    "end_Aired": "Not Available",
    "premiered": "Unknown",
    "broadcast": "Unknown",
    "producers": "Madhouse, VAP, Dentsu, Yomiuri Telecasting, Kadokawa Shoten, Toho, Hiroshima Television",
    "licensors": "Funimation",
    "studios": "Studio Chizu",
    "source": "Original",
    "genres": "Fantasy, Slice of Life",
    "themes": "Childcare",
    "demographics": "Unknown",
    "duration_Minutes": 117,
    "rating": "G - All Ages",
    "score": 8.591,
    "scored_Users": 427057,
    "ranked": 772,
    "popularity": 18,
    "members": 750770,
    "favorites": 10750
  },
  {
    "id": 431,
    "title": "Howl no Ugoku Shiro",
    "synonyms": "Unknown",
    "japanese": "ハウルの動く城",
    "english": "Howl's Moving Castle",
    "synopsis": "That jumbled piece of architecture, that cacophony of hissing steam and creaking joints, with smoke billowing from it as it moves on its own... That castle is home to the magnificent wizard Howl, infamous for both his magical prowess and for being a womanizer—or so the rumor goes in Sophie Hatter's small town. Sophie, as the plain daughter of a hatmaker, does not expect much from her future and is content with working hard in the shop. However, Sophie's simple life takes a turn for the exciting when she is ensnared in a disturbing situation, and the mysterious wizard appears to rescue her. Unfortunately, this encounter, brief as it may be, spurs the vain and vengeful Witch of the Waste—in a fit of jealousy caused by a past discord with Howl—to put a curse on the maiden, turning her into an old woman.In an endeavor to return to normal, Sophie must accompany Howl and a myriad of eccentric companions—ranging from a powerful fire demon to a hopping scarecrow—in his living castle, on a dangerous adventure as a raging war tears their kingdom apart.[Written by MAL Rewrite]",
    "type": "Movie",
    "episodes": 1,
    "status": "Finished Airing",
    "start_Aired": "Nov 20, 2004",
    "end_Aired": "Not Available",
    "premiered": "Unknown",
    "broadcast": "Unknown",
    "producers": "d-rights, Tokuma Shoten",
    "licensors": "Disney Platform Distribution",
    "studios": "Studio Ghibli",
    "source": "Novel",
    "genres": "Adventure, Drama, Fantasy, Romance",
    "themes": "Fantasy",
    "demographics": "Unknown",
    "duration_Minutes": 119,
    "rating": "G - All Ages",
    "score": 8.661,
    "scored_Users": 808568,
    "ranked": 622,
    "popularity": 19,
    "members": 1167125,
    "favorites": 24541
  },
  {
    "id": 9919,
    "title": "Ao no Exorcist",
    "synonyms": "Ao no Futsumashi",
    "japanese": "青の祓魔師(エクソシスト)",
    "english": "Blue Exorcist",
    "synopsis": "Humans and demons are two sides of the same coin, as are Assiah and Gehenna, their respective worlds. The only way to travel between the realms is by the means of possession, like in ghost stories. However, Satan, the ruler of Gehenna, cannot find a suitable host to possess and therefore, remains imprisoned in his world. In a desperate attempt to conquer Assiah, he sends his son instead, intending for him to eventually grow into a vessel capable of possession by the demon king.Ao no Exorcist follows Rin Okumura who appears to be an ordinary, somewhat troublesome teenager—that is until one day he is ambushed by demons. His world turns upside down when he discovers that he is in fact the very son of Satan and that his demon father wishes for him to return so they can conquer Assiah together. Not wanting to join the king of Gehenna, Rin decides to begin training to become an exorcist so that he can fight to defend Assiah alongside his brother Yukio.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 25,
    "status": "Finished Airing",
    "start_Aired": "Apr 17, 2011",
    "end_Aired": "Oct 2, 2011",
    "premiered": "Spring 2011",
    "broadcast": "Sundays at 1700 (JST)",
    "producers": "Aniplex, Dentsu, Mainichi broadcasting System, Movic, Sakura Create, Shueisha",
    "licensors": "Aniplex of America",
    "studios": "A-1 Pictures",
    "source": "Manga",
    "genres": "Action, Fantasy",
    "themes": "Mythology, School",
    "demographics": "Shounen",
    "duration_Minutes": 24,
    "rating": "PG-13 - Teens 13 or older",
    "score": 7.511,
    "scored_Users": 77132,
    "ranked": 16402,
    "popularity": 20,
    "members": 1774322,
    "favorites": 16253
  },
  {
    "id": 37109,
    "title": "Hakumei to Mikochi",
    "synonyms": "Hakumei and Mikochi",
    "japanese": "ハクメイとミコチ",
    "english": "Hakumei and Mikochi",
    "synopsis": "In a world inhabited by people only a few inches tall, young women Hakumei and Mikochi live together in a house built into a tree. Hakumei is an energetic and tomboyish carpenter, while Mikochi is a feminine and calm tailor. Despite their differences, they get along well and spend their days having fun living their lives in the woods.",
    "type": "TV",
    "episodes": 12,
    "status": "Finished Airing",
    "start_Aired": "Jan 12, 2018",
    "end_Aired": "Mar 30, 2018",
    "premiered": "Winter 2018",
    "broadcast": "Fridays at 21:00 (JST)",
    "producers": "Lantis, AT-X, Sony Music Communications, Kadokawa Media House, Kadokawa",
    "licensors": "Sentai Filmworks",
    "studios": "Lerche",
    "source": "Manga",
    "genres": "Fantasy, Slice of Life",
    "themes": "Iyashikei",
    "demographics": "Seinen",
    "duration_Minutes": 24,
    "rating": "PG-13 - Teens 13 or older",
    "score": 7.67,
    "scored_Users": 3288,
    "ranked": 14802,
    "popularity": 21,
    "members": 7725,
    "favorites": 8
  },
  {
    "id": 40748,
    "title": "Jujutsu Kaisen",
    "synonyms": "Sorcery Fight, JJK",
    "japanese": "呪術廻戦",
    "english": "Jujutsu Kaisen",
    "synopsis": "idly indulging in baseless paranormal activities with the Occult Club, high schooler Yuuji Itadori spends his days at either the clubroom or the hospital, where he visits his bedridden grandfather. However, this leisurely lifestyle soon takes a turn for the strange when he unknowingly encounters a cursed item. Triggering a chain of supernatural occurrences, Yuuji finds himself suddenly thrust into the world of Curses—dreadful beings formed from human malice and negativity—after swallowing the said item, revealed to be a finger belonging to the demon Sukuna Ryoumen, the King of Curses.Yuuji experiences first-hand the threat these Curses pose to society as he discovers his own newfound powers. Introduced to the Tokyo Metropolitan Jujutsu Technical High School, he begins to walk down a path from which he cannot return—the path of a Jujutsu sorcerer.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 24,
    "status": "Finished Airing",
    "start_Aired": "Oct 3, 2020",
    "end_Aired": "Mar 27, 2021",
    "premiered": "Fall 2020",
    "broadcast": "Saturdays at 0125 (JST)",
    "producers": "Mainichi broadcasting System, TOHO animation, Shueisha, dugout, Sumzap",
    "licensors": "Unknown",
    "studios": "MAPPA",
    "source": "Manga",
    "genres": "Action, Fantasy",
    "themes": "School",
    "demographics": "Shounen",
    "duration_Minutes": 23,
    "rating": "R - 17+ (violence & profanity)",
    "score": 8.671,
    "scored_Users": 291912,
    "ranked": 532,
    "popularity": 22,
    "members": 1982019,
    "favorites": 74093
  },
  {
    "id": 20507,
    "title": "Noragami",
    "synonyms": "Noragami",
    "japanese": "ノラガミ",
    "english": "Noragami",
    "synopsis": "In times of need, if you look in the right place, you just may see a strange telephone number scrawled in red. If you call this number, you will hear a young man introduce himself as the Yato God.Yato is a minor deity and a self-proclaimed Delivery God, who dreams of having millions of worshippers. Without a single shrine dedicated to his name, however, his goals are far from being realized. He spends his days doing odd jobs for five yen apiece, until his weapon partner becomes fed up with her useless master and deserts him.Just as things seem to be looking grim for the god, his fortune changes when a middle school girl, Hiyori Iki, supposedly saves Yato from a car accident, taking the hit for him. Remarkably, she survives, but the event has caused her soul to become loose and hence able to leave her body. Hiyori demands that Yato return her to normal, but upon learning that he needs a new partner to do so, reluctantly agrees to help him find one. And with Hiyori's help, Yato's luck may finally be turning around.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 12,
    "status": "Finished Airing",
    "start_Aired": "Jan 5, 2014",
    "end_Aired": "Mar 23, 2014",
    "premiered": "Winter 2014",
    "broadcast": "Sundays at 2330 (JST)",
    "producers": "Avex Entertainment, Dentsu, Shochiku, Kodansha, Movic, Ai Addiction, Lawson HMV Entertainment, A-Sketch",
    "licensors": "Funimation",
    "studios": "Bones",
    "source": "Manga",
    "genres": "Action, Fantasy",
    "themes": "Mythology",
    "demographics": "Shounen",
    "duration_Minutes": 24,
    "rating": "PG-13 - Teens 13 or older",
    "score": 7.961,
    "scored_Users": 176835,
    "ranked": 6162,
    "popularity": 23,
    "members": 1978778,
    "favorites": 31615
  },
  {
    "id": 3588,
    "title": "Soul Eater",
    "synonyms": "Unknown",
    "japanese": "ソウルイーター",
    "english": "Soul Eater",
    "synopsis": "Death City is home to the famous Death Weapon Meister Academy, a technical academy headed by the Shinigami—Lord Death himself. Its mission: to raise Death Scythes for the Shinigami to wield against the many evils of their fantastical world. These Death Scythes, however, are not made from physical weapons; rather, they are born from human hybrids who have the ability to transform their bodies into Demon Weapons, and only after they have consumed the souls of 99 evil beings and one witch's soul.Soul Eater Evans, a Demon Scythe who only seems to care about what's cool, aims to become a Death Scythe with the help of his straight-laced wielder, or meister, Maka Albarn. The contrasting duo work and study alongside the hot headed Black☆Star and his caring weapon Tsubaki, as well as the Shinigami's own son, Death the Kid, an obsessive-compulsive dual wielder of twin pistols Patty and Liz.Soul Eater follows these students of Shibusen as they take on missions to collect souls and protect the city from the world's threats while working together under the snickering sun to become sounder in mind, body, and soul.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 51,
    "status": "Finished Airing",
    "start_Aired": "Apr 7, 2008",
    "end_Aired": "Mar 30, 2009",
    "premiered": "Spring 2008",
    "broadcast": "Mondays at 1800 (JST)",
    "producers": "TV Tokyo, Aniplex, Dentsu, Media Factory",
    "licensors": "Funimation",
    "studios": "Bones",
    "source": "Manga",
    "genres": "Action, Comedy, Fantasy, Supernatural",
    "themes": "Unknown",
    "demographics": "Shounen",
    "duration_Minutes": 23,
    "rating": "PG-13 - Teens 13 or older",
    "score": 7.841,
    "scored_Users": 789005,
    "ranked": 8102,
    "popularity": 24,
    "members": 1496286,
    "favorites": 24750
  },
  {
    "id": 21,
    "title": "One Piece",
    "synonyms": "OP",
    "japanese": "ONE PIECE",
    "english": "One Piece",
    "synopsis": "Gol D. Roger was known as the Pirate King, the strongest and most infamous being to have sailed the Grand Line. The capture and execution of Roger by the World Government brought a change throughout the world. His last words before his death revealed the existence of the greatest treasure in the world, One Piece. It was this revelation that brought about the Grand Age of Pirates, men who dreamed of finding One Piece—which promises an unlimited amount of riches and fame—and quite possibly the pinnacle of glory and the title of the Pirate King.Enter Monkey D. Luffy, a 17-year-old boy who defies your standard definition of a pirate. Rather than the popular persona of a wicked, hardened, toothless pirate ransacking villages for fun, Luffy's reason for being a pirate is one of pure wonder: the thought of an exciting adventure that leads him to intriguing people and ultimately, the promised treasure. Following in the footsteps of his childhood hero, Luffy and his crew travel across the Grand Line, experiencing crazy adventures, unveiling dark mysteries and battling strong enemies, all in order to reach the most coveted of all fortunes—One Piece.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": "",
    "status": "Currently Airing",
    "start_Aired": "Oct 20, 1999",
    "end_Aired": "Unknown",
    "premiered": "Fall 1999",
    "broadcast": "Sundays at 0930 (JST)",
    "producers": "Fuji TV, TAP, Shueisha",
    "licensors": "Funimation, 4Kids Entertainment",
    "studios": "Toei Animation",
    "source": "Manga",
    "genres": "Action, Adventure, Fantasy",
    "themes": "Unknown",
    "demographics": "Shounen",
    "duration_Minutes": 24,
    "rating": "PG-13 - Teens 13 or older",
    "score": 8.671,
    "scored_Users": 121979,
    "ranked": 582,
    "popularity": 25,
    "members": 1967217,
    "favorites": 177620
  },
  {
    "id": 512,
    "title": "Majo no Takkyuubin",
    "synonyms": "Witch's Express Delivery",
    "japanese": "魔女の宅急便",
    "english": "Kiki's Delivery Service",
    "synopsis": "Kiki, a 13-year-old witch-in-training, must spend a year living on her own in a distant town in order to become a full-fledged witch. Leaving her family and friends, Kiki undertakes this tradition when she flies out into the open world atop her broomstick with her black cat Jiji.As she settles down in the coastal town of Koriko, Kiki struggles to adapt and ends up wandering the streets with no place to stay—until she encounters Osono, who offers Kiki boarding in exchange for making deliveries for her small bakery. Before long, Kiki decides to open her own courier service by broomstick, beginning her journey to independence. In attempting to find her place among the townsfolk, Kiki brings with her exciting new experiences and comes to understand the true meaning of responsibility.[Written by MAL Rewrite]",
    "type": "Movie",
    "episodes": 1,
    "status": "Finished Airing",
    "start_Aired": "Jul 29, 1989",
    "end_Aired": "Not Available",
    "premiered": "July 29, 1989",
    "broadcast": "Unknown",
    "producers": "Streamline Pictures",
    "licensors": "Disney Platform Distribution, GKidS",
    "studios": "Studio Ghibli",
    "source": "Novel",
    "genres": "Adventure, Comedy, Drama, Fantasy",
    "themes": "Fantasy",
    "demographics": "Unknown",
    "duration_Minutes": 103,
    "rating": "G - All Ages",
    "score": 8.211,
    "scored_Users": 332209,
    "ranked": 3142,
    "popularity": 26,
    "members": 510356,
    "favorites": 4837
  },
  {
    "id": 39196,
    "title": "Mairimashita! Iruma-kun",
    "synonyms": "Unknown",
    "japanese": "魔入りました！入間くん",
    "english": "Welcome to Demon School! Iruma-kun",
    "synopsis": "Fourteen-year-old Iruma Suzuki has been unfortunate all his life, having to work to earn money for his irresponsible parents despite being underage. One day, he finds out that his parents sold him to the demon Sullivan. However, Iruma's worries about what will become of him are soon relieved, for Sullivan merely wants a grandchild, pampering him and making him attend the demon school Babyls. At first, Iruma tries to keep a low profile in fear of his peers discovering that he is human. Unfortunately, this ends up being more difficult than he expected. It turns out that Sullivan himself is the chairman of the school, and everyone expects him to become the next Demon King!Iruma immediately finds himself in an outrageous situation when he has to chant a forbidden spell in front of the entire school. With this, Iruma instantly earns a reputation he does not want. Even so, he is bound to be roped into more bizarre circumstances.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 23,
    "status": "Finished Airing",
    "start_Aired": "Oct 5, 2019",
    "end_Aired": "Mar 7, 2020",
    "premiered": "Fall 2019",
    "broadcast": "Saturdays at 1735 (JST)",
    "producers": "NHK, NHK Enterprises",
    "licensors": "Unknown",
    "studios": "Bandai Namco Pictures",
    "source": "Manga",
    "genres": "Comedy, Fantasy, Supernatural",
    "themes": "Isekai, Mythology, School",
    "demographics": "Shounen",
    "duration_Minutes": 23,
    "rating": "PG-13 - Teens 13 or older",
    "score": 7.751,
    "scored_Users": 208071,
    "ranked": 9902,
    "popularity": 27,
    "members": 385554,
    "favorites": 3328
  },
  {
    "id": 33255,
    "title": "Saiki Kusuo no Ψ-nan",
    "synonyms": "Saiki Kusuo no Psi Nan",
    "japanese": "斉木楠雄のΨ難",
    "english": "The Disastrous Life of Saiki K.",
    "synopsis": "To the average person, psychic abilities might seem a blessing; for Kusuo Saiki, however, this couldn't be further from the truth. Gifted with a wide assortment of supernatural abilities ranging from telepathy to x-ray vision, he finds this so-called blessing to be nothing but a curse. As all the inconveniences his powers cause constantly pile up, all Kusuo aims for is an ordinary, hassle-free life—a life where ignorance is bliss.Unfortunately, the life of a psychic is far from quiet. Though Kusuo tries to stay out of the spotlight by keeping his powers a secret from his classmates, he ends up inadvertently attracting the attention of many odd characters, such as the empty-headed Riki Nendou and the delusional Shun Kaidou. Forced to deal with the craziness of the people around him, Kusuo comes to learn that the ordinary life he has been striving for is a lot more difficult to achieve than expected.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 120,
    "status": "Finished Airing",
    "start_Aired": "Jul 4, 2016",
    "end_Aired": "Dec 26, 2016",
    "premiered": "Summer 2016",
    "broadcast": "Not scheduled once per week",
    "producers": "TV Tokyo, Shogakukan-Shueisha Productions, Pony Canyon, Nippon Columbia, KlockWorx, Asmik Ace, Bandai Namco Entertainment, Shueisha, Toy's Factory, Dear Stage inc.",
    "licensors": "Funimation",
    "studios": "J.C.Staff, Egg Firm",
    "source": "Manga",
    "genres": "Comedy, Supernatural",
    "themes": "Gag Humor, School",
    "demographics": "Shounen",
    "duration_Minutes": 5,
    "rating": "PG-13 - Teens 13 or older",
    "score": 8.421,
    "scored_Users": 536527,
    "ranked": 1532,
    "popularity": 28,
    "members": 956798,
    "favorites": 25790
  },
  {
    "id": 8687,
    "title": "Doraemon (2005)",
    "synonyms": "Unknown",
    "japanese": "ドラえもん (2005)",
    "english": "Doraemon",
    "synopsis": "Doraemon (2005) is the most recent anime series based on Fujiko Fujio's manga of the same name. It is the 2005 version of 1979 series, with certain changes in the animation and other things.Doraemon is a cat-like robot who appears in the present to steer Nobita/Noby, who is a dumb, naive and clumsy boy on the right path in order to secure his future. Nobita's love interest is Shizuka Minamoto/Sue, his frenemies are Takeshi Goda/Big G and Suneo/Sneech.(source: Wikipedia)",
    "type": "TV",
    "episodes": "",
    "status": "Currently Airing",
    "start_Aired": "Apr 22, 2005",
    "end_Aired": "Unknown",
    "premiered": "Spring 2005",
    "broadcast": "Fridays at 1900 (JST)",
    "producers": "TV Asahi",
    "licensors": "Unknown",
    "studios": "Shin-Ei Animation",
    "source": "Manga",
    "genres": "Comedy, Sci-Fi",
    "themes": "Anthropomorphic",
    "demographics": "Kids, Shounen",
    "duration_Minutes": 25,
    "rating": "PG - Children",
    "score": 7.621,
    "scored_Users": 7920,
    "ranked": 13052,
    "popularity": 29,
    "members": 17064,
    "favorites": 194
  },
  {
    "id": 918,
    "title": "Gintama",
    "synonyms": "Gin Tama, Silver Soul, Yorinuki Gintama-san",
    "japanese": "銀魂",
    "english": "Gintama",
    "synopsis": "Edo is a city that was home to the vigor and ambition of samurai across the country. However, following feudal Japan's surrender to powerful aliens known as the Amanto, those aspirations now seem unachievable. With the once-influential shogunate rebuilt as a puppet government, a new law is passed that promptly prohibits all swords in public. Enter Gintoki Sakata, an eccentric silver-haired man who always carries around a wooden sword and maintains his stature as a samurai despite the ban. As the founder of Yorozuya, a small business for odd jobs, Gintoki often embarks on endeavors to help other people—though usually in rather strange and unforeseen ways. Assisted by Shinpachi Shimura, a boy with glasses supposedly learning the way of the samurai; Kagura, a tomboyish girl with superhuman strength and an endless appetite; and Sadaharu, their giant pet dog who loves biting on people's heads, the Yorozuya encounter anything from alien royalty to scuffles with local gangs in the ever-changing world of Edo.[Written by MAL Rewrite]",
    "type": "TV",
    "episodes": 201,
    "status": "Finished Airing",
    "start_Aired": "Apr 4, 2006",
    "end_Aired": "Mar 25, 2010",
    "premiered": "Spring 2006",
    "broadcast": "Thursdays at 1800 (JST)",
    "producers": "TV Tokyo, Aniplex, Dentsu, Trinity Sound, Audio Highs, Miracle Robo, Shueisha",
    "licensors": "Sentai Filmworks, Crunchyroll",
    "studios": "Sunrise",
    "source": "Manga",
    "genres": "Action, Comedy, Sci-Fi",
    "themes": "Gag Humor, Historical, Parody, Samurai",
    "demographics": "Shounen",
    "duration_Minutes": 24,
    "rating": "PG-13 - Teens 13 or older",
    "score": 8.951,
    "scored_Users": 365222,
    "ranked": 142,
    "popularity": 30,
    "members": 966240,
    "favorites": 55670
  } 
  ]