[
{
  "id": 1,
  "name": "Codesmith",
  "img": "https://d92mrp7hetgfk.cloudfront.net/images/sites/misc/21/original.png?1567533742",
  "review": "5.0/5",
  "courses": "Full Stack Software Engineering Immersive Program, JavaScript for Beginners, Part-time Remote Software Engineering Immersive",
  "subjects": "CS Prep, CSX, Full Stack Software Engineering Immersive Program, Full-time Remote Software Engineering Immersive, JavaScript for Beginners,Part-time Remote Software Engineering Immersive",
  "description": "Codesmith offers a software engineering bootcamp that integrates fundamental and advanced tools and technologies in all areas of coding. Students may choose to complete the course on-campus in New York City or remotely in 12 weeks full-time or remotely in around nine months part-time.The curriculum centers on learning front- and back-end development, including instruction in JavaScript,HTML, CSS, React with Redux, Node, Express, and SQL. Students are provided ample opportunity to practice and refine their skills and build their portfolios. Current students and graduates receive extensive career support, resources, and networking opportunities.Codesmith graduates have gone on to software engineering careers with companies like Google, LinkedIn, Netflix, and NPR.In response to the COVID-19 pandemic, all on-campus bootcamps have transitioned to remote instruction.",
  "cost": "$19.350",
  "duration": "12 weeks",
  "isFlexible": "true",
  "guaranteesJob": "false",
  "hasGenderPerspective": "false",
  "url": "https://codesmith.io/"
},
{
  "id": 2,
  "name": "Practicum by Yandex",
  "img": "https://d92mrp7hetgfk.cloudfront.net/images/sites/misc/ya_practicum_icon_528/original.jpg?1575484554",
  "review": " 4.92/5 ",
  "courses": "Web Developer",
  "subjects": "Data Analytics, Data Science, JavaScript, Web Development",
  "description": "Practicum by Yandex’s web development bootcamp trains students in modern and relevant coding tools, technologies, and techniques.The ten-month, 720-hour curriculum includes portfolio projects, coding tasks, and code exercise review and feedback. Students advance from the fundamentals of JavaScript, CSS, and HTML to more advanced applications of programming and coding, back-end design, and interface development. In the final, 120-hour project, students complete a practical, real-world coding task with a deadline to showcase the knowledge and skills they have mastered. Students enrolled in the web development bootcamp can choose to supplement their technical training with a career prep course, which provides students resources and support in finding, applying to, and landing a job in the industry.The fully online web development bootcamp at Practicum by Yandex has not been affected by COVID-19 restrictions.",
  "cost": "$5.000",
  "duration":"34 weeks",
  "isFlexible": "false",
  "guaranteesJob": "true",
  "hasGenderPerspective": "false",
  "url":"https://practicum.yandex.com/"  
},
{
  "id": 3,
  "name": "Altcademy",
  "img": "https://d92mrp7hetgfk.cloudfront.net/images/sites/misc/altcademy-square-logo-800x800-white-on-blue_2/original.png?1585695880",
  "review": " 4.92/5 ",
  "courses": "Front-end Web Development, Full-stack Web Development, Back-end Web Development",
  "subjects": "AJAX, Algorithms, AngularJS, API, Bootstrap",
  "description":"Altcademy is a 100% online education institute offering affordable intensive programs to help students become software developers. Their web development syllabus covers back-end and front-end technologies, including JavaScript, jQuery, HTML, CSS, React, and Ruby on Rails. Altcademy's programs are designed for self-study and they provide support through chat rooms and 1-on-1 coached office hours (live video conference). Altcademy was founded by a team of programmers who believe empowering people with programming skills can transform their lives and shape a better future.",
  "cost":"$1,045",
  "duration": "40 weeks",
  "isFlexible": "true",
  "guaranteesJob": "false",
  "hasGenderPerspective":"false", 
  "url": "https://www.altcademy.com/" 
},
{
  "id": 4,
  "name": "Technigo",
  "img": "https://www.shortstoriesinspanish.com/wp-content/uploads/2021/05/technigo-logo.jpg",
  "review": "5.0/5",
  "courses": "JavaScript (ES6), HTML, CSS, API's, React, Redux, Node.js, React Native" ,
  "subjects": "Frontend deveopment in modern JavaScript (ES6), Responsive web design using HTML and CSS, Mobile app development, Backend programming with Node.js",
  "description": "In just 24 weeks, we’ll teach you the latest technologies within frontend development using Javascript. For the last four years, we have educated people with zero experience in programming and turned them into web developers.",
  "cost": "5670 € incl. VAT.",
  "duration": "24 weeks",
  "isFlexible": "true",
  "guaranteesJob":"false",
  "hasGenderPerspective": "true",
  "url":"https://www.technigo.io/"   
}, 
{
  "id": 5,
  "name": "SheCodes",
  "img": "https://d92mrp7hetgfk.cloudfront.net/images/sites/misc/shecodes-white/original.png?1580419350",
  "review": "4.95/5",
  "courses": "SheCodes Basics, SheCodes Plus, SheCodes Pro",
  "subjects": "CSS, Git, Github, HTML, JavaScript",
  "description": "SheCodes is a coding school that offers online coding bootcamps for women. Since the bootcamps are online, SheCode programs are not affected by the COVID-19 pandemic. SheCodes Workshop is a three-week bootcamp that introduces students to front-end development. Students will spend approximately five hours per week studying with live technical support. The SheCodes Plus workshop is an eight-week course that teaches everything in the standard workshop along with classes in Bootstrap, Git, and hosting. SheCodes React teaches students how to build web applications with React. SheCodes also offers a free 60-minute coding session for beginners to become familiar with coding and help them decide if this career path is the right fit.",
  "cost": "$1.390" ,
  "duration": "22 weeks" ,
  "isFlexible": "true",
  "guaranteesJob": "false" ,
  "hasGenderPerspective": "true",
  "url": "https://www.shecodes.io/"  
},
{
  "id": 6,
  "name": "Hack Reactor" ,
  "img":"https://d92mrp7hetgfk.cloudfront.net/images/sites/misc/hack/original.png?1560210046",
  "review": "4.88/5",
  "courses": "Software Engineering Immersive, Part Time Software Engineering Immersive",
  "subjects": "Hack Reactor Remote + Blockchain, Part Time Software Engineering Immersive, Software Engineering Immersive, Software Engineering Premium Prep",
  "description": "Founded in 2012, Hack Reactor is a 12-week immersive coding school providing software engineering education, career placement services, and a lifelong network of professional peers. Hack Reactor has campuses in San Francisco, Austin, Los Angeles, and New York City, as well as an online, remote immersive (full-time and part-time). After 800+ hours of curriculum, students graduate as full-stack software engineers and JavaScript programmers.",
  "cost": "$17.980",
  "duration":"36 weeks",
  "isFlexible": "true",
  "guaranteesJob":"false" ,
  "hasGenderPerspective": "false" ,
  "url":"https://www.hackreactor.com/"   
},
{
  "id": 7,
  "name": "Coding Dojo",
  "img":"https://d92mrp7hetgfk.cloudfront.net/images/sites/misc/codingdojo/original.png?1568083063",
  "review":"4.91/5",
  "courses": "Data Science Online Part-Time, One-Day Intro to Programming, Online Full-Time Coding Bootcamp, Online Part-Time Coding Bootcamp (Accelerated), Online Part-Time Coding Bootcamp (Flex), Onsite Full-Time Coding Bootcamp" ,
  "subjects":" .NET, AJAX, AngularJS, ASP.NET, ASP.NET MVC" ,
  "description":"Coding Dojo offers online coding bootcamps, and it has temporarily closed its 10 campus locations in response to COVID-19. Its online full-time coding bootcamp teaches students the skills to become full-stack developers. It starts with web fundamentals and then teaches students three complete web stacks. Developers will learn Python, Java, and the MERN (Mongo, Express, React, and Node.js) stack. Once they graduate, students will receive help from the career services team for their job hunt and setting their career goals. Over 4,500 students have graduated from Coding Dojo in its 10-year history, and they have been placed at jobs in over 500 companies, including Google, Facebook, Amazon, and eBay.",
  "cost":"$7.995",
  "duration":"28 weeks",
  "isFlexible":"true",
  "guaranteesJob":"false" ,
  "hasGenderPerspective":"false", 
  "url":"https://www.codingdojo.com/"  
},
{
  "id": 8,
  "name":"The Tech Academy" ,
  "img":"https://d92mrp7hetgfk.cloudfront.net/images/sites/misc/thetechacademy/original.jpg?1568415676",
  "review":"4.93/5" ,
  "url":"https://www.learncodinganywhere.com/",
  "courses":"Full-Time Software Developer Boot Camp, Full-Time Python Developer Boot Camp, Full-Time C# and .NET Framework Boot Camp" ,
  "subjects":"NET, Agile, Android, App Development, ASP.NET and more..." ,
  "description":"The Tech Academy offers several online coding bootcamps and individual courses to best meet the career goals and interests of each student. All self-paced bootcamps are available full- and part-time and range in length from eight to 40 weeks. Available bootcamps include those focusing on software development, C# and .NET, Python, and front-end web development. The final course in all Tech Academy bootcamps is in job placement, which instructs students on finding jobs in the industry, creating a resume, and participating in interviews. Students also have access to a number of dedicated career services, including assistance from the academy’s job placement staff. All online courses and bootcamps continue to operate as normal during the COVID-19 pandemic.",
  "cost":"$11.660" ,
  "duration":"22 weeks" ,
  "isFlexible":"true" ,
  "guaranteesJob":"false" ,
  "hasGenderPerspective":"false"    
},
{
  "id": 9,
  "name":"OpenClassrooms" ,
  "img":"https://d92mrp7hetgfk.cloudfront.net/images/sites/misc/openclassrooms/original.jpg?1568084314",
  "review":"5.0/5",
  "courses":"Ruby Developer, Front-End Developer, Full-Stack Developer",
  "subjects":" Android, Bootstrap, CSS, Design Principles, HTML and more..." ,
  "description":"OpenClassrooms offers a number of learning paths in coding, leading to an associate- or bachelor’s-level diploma. Paths include front- and back-end development, Android and iOS mobile development, and full-stack development. Students can choose to complete any course of study full-time in 12 months or at their own pace. The learning model of OpenClassrooms centers on weekly, one-on-one mentorship and professional projects, providing students with a personalized, supportive learning environment and a portfolio of work to provide to future, prospective employers. The remote bootcamps at OpenClassrooms have not been affected by any COVID-19-related restrictions.",
  "cost":"$3600" ,
  "duration":"undefined",
  "isFlexible":"true",
  "guaranteesJob":"true",
  "hasGenderPerspective":"false",
  "url":"https://openclassrooms.com/en/" 
},
{
  "id": 10,
  "name":"School of IT",
  "img":"https://d92mrp7hetgfk.cloudfront.net/images/sites/misc/School_Of_IT/original.png?1560210119",
  "review":"4.9/5",
  "courses":"Web Development Course, Software Development Course, Software Engineering Course",
  "subjects":"C#, C++, CSS, Data Structures, Database Design and more",
  "description":"The School of IT offers multiple online courses in coding, including a full-stack development bootcamp. Students can choose to take courses in a number of programming and development areas and languages, including Python, JavaScript, HTML, CSS, Ruby, and Angular. Students work one-on-one with a mentor, and classes can be scheduled to work around the student’s availability. Depending on how intensive the student’s course schedule is, the bootcamps can be completed in three to six months. Students receive a certificate of achievement upon completion of the program and can choose to complete industry accreditation exams, including those in Microsoft, Oracle, and Adobe. The School of IT’s online courses are continuing as scheduled during the COVID-19 pandemic.",
  "cost":"$25.800",
  "duration":"12 weeks" ,
  "isFlexible":"true",
  "guaranteesJob":"false",
  "hasGenderPerspective":"false",
  "url":"https://schoolofit.co.uk/"    
},
{
  "id": 11,
  "name":"Actualize",
  "img":"https://d92mrp7hetgfk.cloudfront.net/images/sites/misc/actualize-1/original.jpg?1568074228",
  "review":"4.89/5",
  "courses":"Actualize Coding Bootcamp: Part-Time, Actualize Coding Bootcamp: Online Live, Actualize Coding Bootcamp: Full-Time",
  "subjects":"CSS, Git, HTML, JavaScript, Ruby and more..." ,
  "description":"Unimpacted by the COVID-19 pandemic, Actualize continues to offer a live online coding bootcamp to prepare students for a job in the tech industry. Instructors are not only skilled programmers but are also accomplished educators. The course starts with four weeks of pre-work that prepares students for the main course. The main course that lasts 12 weeks is taught live and is followed by exercises to help students understand what they have learned. The course includes lessons on Ruby on Rails, Git, and SQL to teach students back-end skills. HTML, CSS, JavaScript, and Vue.js are taught to round out the full-stack education with front-end web development skills. Students can choose from a daytime schedule or a night and weekend schedule. Career support helps students find a job after they graduate.",
  "cost":"$13,900",
  "duration":"16 weeks",
  "isFlexible":"true",
  "guaranteesJob":"false",
  "hasGenderPerspective":"false",
  "url":"http://anyonecanlearntocode.com/"     
},
{
  "id": 12,
  "name":"Skillcrush" ,
  "img":"https://d92mrp7hetgfk.cloudfront.net/images/sites/misc/skillcrush-logo/original.png?1560210124",
  "review":"4.83/5",
  "courses":"Wordpress Development, Front End Development" ,
  "subjects":" Career Coaching, Collaboration, Command Line, CSS, Design Principles and more..." ,
  "description":"Skillcrush offers students the opportunity to complete an online coding bootcamp designed for flexible scheduling. Students can choose between four bootcamps that offer instruction in specialized areas of coding, including Python for web apps and data, WordPress development, front-end development, and front-end development with ReactJS. All courses and project work are mentor-led, allowing students to have regular meetings, correspondence, and feedback from their expert advisor(s). Skillcrush offers students access to on-demand career counseling, peer and student community feedback, and expert reviews of resumes and portfolios to best prepare them to find a job upon completion of the Bootcamp. Since all classes are online and self-paced, the bootcamps at Skillcrush have been unaffected by COVID-19. Skillcrush is offering discounts on its coding bootcamps to people who have lost their job during the pandemic.",
  "cost":"$499",
  "duration":"12 weeks",
  "isFlexible": "true",
  "guaranteesJob": "true",
  "hasGenderPerspective":"true",
  "url":"https://skillcrush.com/"  
},
{
  "id": 13,
  "name":"React GraphQL Academy",
  "img":"https://d92mrp7hetgfk.cloudfront.net/images/sites/misc/reactgraphql/original.jpg?1568417967",
  "review":"4.94/5",
  "courses": "React, Redux & GraphQL Bootcamp, React, Redux Fundamentals Training, Complete React Part-time Training, and more...",
  "subjects":"Functional Programming, GraphQL, JavaScript, Mobile, React.js",
  "description":"React GraphQL Academy provides both immersive and part-time coding courses focused on React and GraphQL technology. Immersive courses include React Bootcamp, Advanced React, React Fundamentals, GraphQL API, and workshops. Part-time courses include the React Part-Time Bundle, React Fundamentals PT, and Advanced React PT. These cover similar topics, but in a more relaxed format. Classes are held both online and in London — and training will be scheduled in-person starting in October 2020. React GraphQL Academy also provides corporate training for companies looking to train their employees or looking to provide educational refreshers. Workshop offerings are single-day events about discrete, focused topics such as Real-World Testing in React, Styling in React and Design Systems, and Advanced Patterns and Performance.",
  "cost":"$1,100 - $1,450",
  "duration":"3 weeks",
  "isFlexible":"true",
  "guaranteesJob":"false",
  "hasGenderPerspective":"false",
  "url":"https://reactgraphql.academy/"  
},
{
  "id": 14,
  "name":"App Academy",
  "img":"https://d92mrp7hetgfk.cloudfront.net/images/sites/misc/App_Academy_logo-8/original.png?1567098952",
  "review":"4.72/5",
  "courses":"Software Engineer Track: In-Person, Software Engineer Track: Online, App Academy Open",
  "subjects":"Algorithms, CSS, Design Principles, Docker, Express.js and more" ,
  "description":"App Academy teaches development with a 24-week online coding bootcamp that is unaffected by COVID-19. Its software engineer track teaches students the skills to be full-stack developers. Students learn front-end development starting with the basics of HTML, CSS, and JavaScript. They will also write React/Flux code. To gain back-end development skills, students learn Ruby and SQL. Another App Academy course is a 40-hour online bootcamp prep course to help students decide whether programming is right for them and prepare them for bootcamp-level courses. App Academy also offers career training to help graduates enter the workforce.",
  "cost":"$20,000",
  "duration":"24 weeks",
  "isFlexible":"true" ,
  "guaranteesJob":"true" ,
  "hasGenderPerspective":"false",
  "url":"https://open.appacademy.io/"   
},
{
  "id": 15,
  "name":"Udacity",
  "img":"https://d92mrp7hetgfk.cloudfront.net/images/sites/misc/Udacity_logo/original.png?1571158531",
  "review":"4.66/5",
  "courses":"Front End Web Developer, Full Stack Web Developer, Java Developer and more...",
  "subjects":"Algorithms, Artificial Intelligence (AI), Blockchain, Blockchain and Crypto, Business and more..." ,
  "description":"Udacity is an online educational institution that gives students planning a career in programming the choice of over 30 options for online coding bootcamps — which have not been impacted by COVID-19. These nanodegree programs teach students the knowledge required for entry-level tech jobs. Students will devote 5 to 10 hours a week for at least four months to graduate from one of Udacity's programs, allowing students with a full-time job or family obligations more flexibility. Some of the nanodegree programs available are Back-End Development, Front-End Development, Java Development, Ios Development, Android Development, DevOps Development, and Cloud Development. Udacity offers financial support including scholarships to help students start their education. All nanodegree students can receive career counseling that will help get their resume, LinkedIn profile, and Github profile ready to show to employers." ,
  "cost": "Depends on course",
  "duration":"depends on course",
  "isFlexible": "true",
  "guaranteesJob": "false",
  "hasGenderPerspective": "false",
  "url":"https://www.udacity.com/"  
},
{
  "id": 16,
  "name":"Code Institute",
  "img":"https://d92mrp7hetgfk.cloudfront.net/images/sites/misc/Code_Institute_logo/original.png?1567099004",
  "review":"4.58/5" ,
  "courses":"Free 5 Day Coding Challenge, Diploma in FullStack Software Development",
  "subjects":"AngularJS, Career Coaching, CSS, Database Management, Django",
  "description":"Code Institute offers a full-stack software development bootcamp accessible to those with no previous coding experience. Students work a minimum of 12 hours a week on the remote course through Code Institute’s dedicated virtual learning platform and have access to student support and tutoring 24 hours a day, Monday through Friday. The institute also offers its students and graduates career support, one-on-one mentoring, and access to remote working opportunities and the institute’s network of more than 100 global hiring partners. Prospective students are invited to enroll in a free introductory course covering the basics of HTML, CSS, and JavaScript to see if a career in coding, and Code Institute in particular, are the best fit for them. Since students complete the coding bootcamp entirely online, learning at Code Institute has not been affected by the COVID-19 pandemic.",
  "cost":"€6,500",
  "duration":"16 weeks",
  "isFlexible":"true",
  "guaranteesJob":"false" ,
  "hasGenderPerspective":"false",
  "url":"https://codeinstitute.net/"   
},
{
  "id": 17,
  "name":"HyperionDev",
  "img":"https://d92mrp7hetgfk.cloudfront.net/images/sites/misc/Profile-Pic/original.png?1560210050",
  "review":"4.43/5",
  "courses":"Full Stack Web Developer Bootcamp, Software Engineering Bootcamp",
  "subjects":"Android, C#, C++, Coding, CSS",
  "description":"Hyperion Development offers part-time and full-time online coding bootcamps that have not been impacted by COVID-19. Students work in a 1:1 mentorship with instructors and spend about 10 to 20 hours per week learning in the part-time program or 40 hours per week in the full-time program. The full-stack web development and software engineer course is a six-month full-time course that teaches HTML, CSS, JavaScript, Java, and the MERN (MongoDB, Express, React, Node.js) stack. The full-stack web development course teaches students basic web development and the MERN stack. This course takes three to six months depending on whether it is a full-time or part-time course. The software engineer bootcamp teaches Python and Java, as well as machine learning, version control, and data structures. Hyperion Development provides students with career counseling to help them find a job upon graduation.",
  "cost":"£7,493",
  "duration":"24 weeks",
  "isFlexible":"true",
  "guaranteesJob":"false",
  "hasGenderPerspective":"false",
  "url":"https://www.hyperiondev.com/"   
},
{
  "id": 18,
  "name":"Woz U",
  "img":"https://d92mrp7hetgfk.cloudfront.net/images/sites/misc/wozU/original.jpg?1560210176",
  "review":"4.38/5",
  "courses":"Full Stack Web Development Program",
  "subjects":"NET, AngularJS, C#, CSS, Cyber Security and more...",
  "description":"Woz U’s software development bootcamp allows students to choose to focus their studies in front-end, back-end, or full-stack web development. The curriculum of the three-month front-end program provides instruction in the fundamentals of HTML, CSS, and JavaScript, while that of the four-month back-end course delves further into server-side programming languages and applications. The eight-month full stack bootcamp instructs students in more advanced topics in both front- and back-end development in addition to mobile application design, deployment, and security. All Woz U students have access to one-on-one mentorship, career coaching, and job search support. The online bootcamps offered at Woz U have not been affected by Covid-19 restrictions.",
  "cost":"$13,200",
  "duration":"33 weeks",
  "isFlexible":"true",
  "guaranteesJob":"false",
  "hasGenderPerspective":"false",
  "url": "https://woz-u.com/"   
},
{
  "id": 19,
  "name":"Lambda School",
  "img":"https://d92mrp7hetgfk.cloudfront.net/images/sites/misc/lambda-logo-bg/original.png?1612391563",
  "review":"3.85/5",
  "courses":"Full Time Full Stack Web Development",
  "subjects":"Algorithms, Artificial Intelligence (AI), C, Career Coaching, CSS and more..." ,
  "description":"Lambda School offers students the opportunity to complete a full-stack web development bootcamp in nine months (full-time) or 18 months (part-time). Students receive instruction in all areas of coding and web development, including JavaScript, HTML, CSS, Node, React, Python, Redux, and SQL. Classes are entirely online, live, and interactive, and can be adapted to work in the time zone of the student. Students collaborate in groups of six to eight to create a new product, providing practical and real-world experience in the industry. Lambda School offers its graduates access to a number of career services, including dedicated job search trainers. Lambda School bootcamps are facilitated remotely and continue to run normally during the COVID-19 pandemic.",
  "cost":"Free",
  "duration":"26 weeks",
  "isFlexible":"true",
  "guaranteesJob":"true",
  "hasGenderPerspective":"false",
  "url": "https://lambdaschool.com/"   
},
{
  "id": 20,
  "name":"Nucamp",
  "img":"https://d92mrp7hetgfk.cloudfront.net/images/sites/misc/Nucamp_logo/original.png?1567100358",
  "review":"4.52/5",
  "courses":"Full Stack Web and Mobile App Development, Web Development Fundamentals, Front End Web and Mobile Development",
  "subjects":"Angular, Bootstrap, CSS, Express.js, HTML and more..." ,
  "description":"Nucamp’s coding bootcamp offerings vary by skill levels — from a beginning course in the fundamentals of web development to advanced programs in front-end or full-stack web development plus mobile development. Course lectures and exercises are completed primarily online, and students meet once per week for Saturday coding workshops. All of Nucamp’s bootcamps are part-time, requiring between eight and 14 hours of commitment a week, and range in length from four to 22 weeks. The beginner web development course teaches HTML, CSS, and JavaScript, and the more advanced bootcamps build and expand on these fundamentals. Each bootcamp cohort is capped at 12 participants, and students collaborate through online forums and portfolio projects. In response to the COVID-19 pandemic, many of Nucamp’s campuses have moved their Saturday in-person workshops online.",
  "cost":"$1,765",
  "duration":"22 weeks" ,
  "isFlexible":"true" ,
  "guaranteesJob":"false" ,
  "hasGenderPerspective":"false",
  "url":"https://www.nucamp.co/"    
}
]