[
    {
        "name": "BitDegree",
        "language": "English",
        "type": "Learning platform",
        "programming_language": "Python, JavaScript, CSS, HTML, PHP, SQL, Bootstrap, JQuery, Git",
        "topic": "Coding resources, code examples, guides, tutorials, video courses",
        "url": "https://www.bitdegree.org/learn/",
        "description": "A site where you can find plenty of explained code examples in different programming languages, lot of informative articles, video guides and tutorials. If you want to increase your knowledge and learn how to code, this will be a useful resource.",
        "offer_training": true,
        "free_or_paid": "free"
    },
    {
        "name": "Coursera",
        "language": "English",
        "type": "Education platform",
        "programming_language": "Python, CSS, JavaScript, HTML",
        "topic": "Education resource",
        "url": "https://www.coursera.org/",
        "description": "A site where they have gathered plenty of courses and programs where you can study online at some of the most well recognized schools in the world. Study for free, and pay if you want to get a certificate after completing your courses.",
        "offer_training": true,
        "free_or_paid": "free, paid"
    },
    {
        "name": "Codecademy",
        "language": "English",
        "type": "Learning platform",
        "programming_language": "HTML, CSS, JavaScript, Python, SQL, Kotlin, Swift",
        "topic": "Educational articles, online training, forum",
        "url": "https://www.codecademy.com/",
        "description": "A very popular website where you can learn to code in different programming languages. You can start learning for free, but can also update to a paid subscription in order to get full access. You can also download a mobile application and spend 10 minutes per day learning how to code.",
        "offer_training": true,
        "free_or_paid": "free, paid"
    },
    {
        "name": "edX",
        "language": "English, Spanish",
        "type": "Education platform",
        "programming_language": "HTML, CSS, JavaScript, Java, Python, Node, React, React Native, Bootstrap",
        "topic": "Education resource",
        "url": "https://www.edx.org/course/subject/computer-science",
        "description": "A platform where you can find hundreds of courses and programs at well recognized universities and schools around the world. Join a program in data science or learn how to program with Python, it's all there. Some of the educations will even give you college credits, while most will give you a professional certificate.",
        "offer_training": true,
        "free_or_paid": "paid"
    },
    {
        "name": "Codewars",
        "language": "English",
        "type": "Code challenges",
        "programming_language": "JavaScript, C, SQL, Swift, Java, Kotlin, PHP, Perl, Python, Ruby",
        "topic": "Code challenges",
        "url": "https://www.codewars.com/",
        "description": "Practice and improve your skills by accepting code challenges in the programming language of your choice. The challenges comes with different complexity, which means you can start at an easy level and build your skills until you're ready to take on the harder ones.",
        "offer_training": true,
        "free_or_paid": "free"
    },
    {
        "name": "Udemy",
        "language": "English, German, Polish, Italian, French, Bahasa Indonesia, Netherlands, Portuguese, Romanian, Turkish",
        "type": "Education platform",
        "programming_language": "Python, Ruby, Java, JavaScript, CSS, HTML, Bootstrap, Angular, React, React Native, Node",
        "topic": "Online courses",
        "url": "https://www.udemy.com/",
        "description": "Platform with hundreds of online courses within different topics. You can study for a month or for a year, depending on which goals you strive to achieve. The courses are self-paced, which means you can sign up and complete the course whenever it suits you. Whether you can spend an hour a day, or 8 hours per day, you can still sign up for these educations.",
        "offer_training": true,
        "free_or_paid": "paid"
    },
    {
        "name": "Dash General Assembly",
        "language": "English",
        "type": "Learning platform",
        "programming_language": "HTML, CSS, JavaScript",
        "topic": "Online training",
        "url": "https://dash.generalassemb.ly/",
        "description": "A website where you can get an intro to how to code with HTML, CSS and JavaScript. You will get a chance to create small projects where you can practice your new skills and get a better understanding for how to use your knowledge.",
        "offer_training": true,
        "free_or_paid": "free"
    },
    {
        "name": "Free Code Camp",
        "language": "English",
        "type": "Learning platform",
        "programming_language": "HTML, CSS, JavaScript, Bootstrap, React, Redux, JQuery, SASS, APIs, Python, Node, MongoDB",
        "topic": "Online training, tutorials",
        "url": "https://www.freecodecamp.org/",
        "description": "A website where you can study and earn certificates for free. Choose among many different topics, such as creating responsive websites with CSS, HTML and JavaScript or data analysis with Python just to mention a few examples.",
        "offer_training": true,
        "free_or_paid": "free"
    },
    {
        "name": "Code Conquest",
        "language": "English",
        "type": "Coding guide",
        "programming_language": "PHP, JavaScript, Ruby, HTML, CSS, Python, Java, ",
        "topic": "Guides, reviews, blog posts, tutorials",
        "url": "https://www.codeconquest.com/",
        "description": "A website which offer a knowledge center where you can read a lot about different programming languages and how to get started with coding. You can also find interesting blog posts, and a lot of tutorials on how to code. In case you are planning to take a course at some of all the online education platforms you might also find it interesting to go through the reviews of the options.",
        "offer_training": true,
        "free_or_paid": "free, paid"
    },
    {
        "name": "The Odin Project",
        "language": "English",
        "type": "Learning platform",
        "programming_language": "CSS, HTML, JavaScript, React, Ruby on Rails, Node, Express, MongoDB, SQL",
        "topic": "Online training, fullstack courses, tutorials",
        "url": "https://www.theodinproject.com/",
        "description": "A website where you can take complete courses without having to pay. A huge amount of lessons in a programming language of your choice. You can choose to learn the foundation with HTML, CSS and JavaScript, but also to continue on the fullstack path where you can choose between going with the JavaScript direction with Node.js or Ruby on Rails path.",
        "offer_training": true,
        "free_or_paid": "free"
    },
    {
        "name": "W3 Schools",
        "language": "English",
        "type": "Learning platform",
        "programming_language": "HTML, CSS, JavaScript, Python, SQL, PHP, jQuery, Java",
        "topic": "Online training, tutorials, code examples, coding exercises",
        "url": "https://www.w3schools.com/",
        "description": "A website which offer a large amount of tutorials, exercises and online training in various programming languages. Start with the basics in HTML and CSS, just to continue with the more advanced programming languages afterwards. W3 Schools also offer paid courses, but most resources are free.",
        "offer_training": true,
        "free_or_paid": "free, paid"
    },
    {
        "name": "hackr.io",
        "language": "English",
        "type": "Resource collection",
        "programming_language": "Python, JavaScript, C, Java, Bootstrap, jQuery, HTML, CSS, React, Node, Django, SQL, Angular, React Native, Redux, Kotlin, Vue, Ruby, Ruby on Rails",
        "topic": "Tutorials, list of programming resources",
        "url": "https://hackr.io/",
        "description": "A website where a large amount of programming training resources have been gathered. You can select the programming language that you would like to learn, and get a list of lots of options where you can learn and practice that specific language. You can also submit tutorials to this website, as well as find tutorials published by others.",
        "offer_training": false,
        "free_or_paid": "free, paid"
    },
    {
        "name": "Bento",
        "language": "English",
        "type": "Learning platform",
        "programming_language": "HTML, CSS, Git, Python, Flask, SQL",
        "topic": "tutorials, guides, resource library",
        "url": "https://bento.io/",
        "description": "A website where you can learn how to code with help from a large amount of collected tutorials from various resources. You can choose your direction and follow a path to learn everything within programming, such as frontend development, backend development, how to handle databases and a lot of other useful things. You don't have to pay anything to get access to this resource library and to get started with your coding practice.",
        "offer_training": true,
        "free_or_paid": "free"
    },
    {
        "name": "Code Avengers",
        "language": "English, German, Spanish, Portuguese, French, Netherlands, Maori",
        "type": "Learning platform",
        "programming_language": "HTML, CSS, JavaScript, Python",
        "topic": "online courses",
        "url": "https://www.codeavengers.com/",
        "description": "A website where kids and teenagers at a beginner level can learn how to code, and where teachers can find useful inspiration and learn how to teach their students how to code. Available in several languages.",
        "offer_training": true,
        "free_or_paid": "paid"
    },
    {
        "name": "Solo Learn",
        "language": "English,",
        "type": "Learning platform",
        "programming_language": "HTML, CSS, JavaScript, Python, Ruby on Rails, Ruby, SQL, React, Redux, Python, Kotlin, C, PHP, jQuery",
        "topic": "quiz, online training, blog posts, tutorials, forum",
        "url": "https://www.sololearn.com/home",
        "description": "A platform where you can learn how to code in the programming language of your choice. Get access to an extended amount of tutorials, take a quiz or two whenever you have time, and learn in an interactive way. There is also a forum where you can discuss things with other people and you can read plenty of blog posts on different coding topics.",
        "offer_training": true,
        "free_or_paid": "free, paid"
    },
    {
        "name": "Upskill",
        "language": "English",
        "type": "Learning platform",
        "programming_language": "JavaScript, jQuery, Node, Bootstrap, CSS, HTML, Ruby on Rails, PHP, MySQL, React, Vue, Backbone",
        "topic": "Free coding bootcamp",
        "url": "https://upskillcourses.com/",
        "description": "This is a free coding bootcamp which is self-paced, which means you can join and start your procedure towards learning how to code, but don't have to follow a set schedule. You will get access to the full curriculum for free, which consists of 197 lessons at the moment, within different coding languages such as JavaScript, Ruby and more.",
        "offer_training": true,
        "free_or_paid": "free"
    },
    {
        "name": "Edabit",
        "language": "English",
        "type": "Code challenges",
        "programming_language": "JavaScript, Java, C, PHP, Python, Swift",
        "topic": "code challenges, tutorials",
        "url": "https://edabit.com/challenges",
        "description": "A website where you can watch videos, follow tutorials and take on code challenges. You can start with very easy ones, and continue until you feel comfortable with even solving the most difficult ones.",
        "offer_training": true,
        "free_or_paid": "free, paid"
    },
    {
        "name": "Coderbyte",
        "language": "English",
        "type": "Code challenges",
        "programming_language": "Angular, C, Bash, GraphQL, HTML, CSS, Java, JavaScript, Kotlin, jQuery, MySQL, Node, Python, PHP, React, React Native, Ruby, Swift, Vue",
        "topic": "code challenges, tutorials",
        "url": "https://www.coderbyte.com/",
        "description": "A website where you can learn how to code and improve your coding skills by watching tutorial videos and solving code challenges. Challenges and tutorials are available for plenty of programming languages and libraries and you can go from beginner to advanced level here.",
        "offer_training": true,
        "free_or_paid": "free, paid"
    },
    {
        "name": "HackerRank",
        "language": "English",
        "type": "Code challenges",
        "programming_language": "Angular, Python, Ruby, SQL, JavaScript",
        "topic": "tutorials, code challenges, interview preparation, job ads",
        "url": "https://www.hackerrank.com/dashboard",
        "description": "A website where you can practice and improve your coding skills by taking on code challenges. You can also get advice on how to prepare for your job interview, as well as view available jobs in the job ad page. What makes this website even more interesting is that you can also find challenges related to other topics, such as artifical intelligence and mathematics.",
        "offer_training": true,
        "free_or_paid": "free, paid"
    },
    {
        "name": "CodeChef",
        "language": "English",
        "type": "Code challenges",
        "programming_language": "C, Java, Python, SQL",
        "topic": "code challenges, tutorials, coding competitions",
        "url": "https://www.codechef.com/",
        "description": "Website where you can go through plenty of tutorials written by members of the community, and take on code challenges. The site is filled with hundreds of challenges, which means you'll be able to practice for a long time, starting from scratch and slowly building up your skills until you can deal with more difficult tasks.",
        "offer_training": true,
        "free_or_paid": "free"
    },
    {
        "name": "Exercism",
        "language": "English",
        "type": "Code challenges",
        "programming_language": "Bash, Delphi Pascal, Pharo, Perl 5, Java, Swift, PHP, Ruby, Clojure, Go, JavaScript, Elixir, Python, C, Kotlin",
        "topic": "Exercises, code challenges, mentor-based learning",
        "url": "https://exercism.io/",
        "description": "A website where you can practice coding after you've made your programming language choice. There are more than 50 different coding languages and libraries to choose from, and you will get plenty of exercises and code challenges to work with. After you've completed the tasks, you'll be able to go through them with a mentor.",
        "offer_training": true,
        "free_or_paid": "free"
    },
    {
        "name": "Leet Code",
        "language": "English",
        "type": "Code challenges",
        "programming_language": "",
        "topic": "Code challenges, code interview platform, coding contests",
        "url": "https://leetcode.com/",
        "description": "A website where you can test your skills and improve them with code challenges. The purpose of the website and its challenges is to help you prepare for job interviews, where you are very likely to face a few code tests. When you submit your proposed solution, you will be able to see how fast your solution runs compared to other solutions provided. There are also discussion boards where you will be able to seek inspiration.",
        "offer_training": true,
        "free_or_paid": "free, paid"
    },
    {
        "name": "Sphere Online Judge",
        "language": "English, Polish, Portuguese, Vietnamese",
        "type": "Code challenges",
        "programming_language": "C, Pascal, Java, Python, Perl, PHP, Ruby",
        "topic": "Code challenges, coding contests",
        "url": "https://www.spoj.com/",
        "description": "Thousands of code challenges in different programming levels with an online judge system that decides if your solution passes or fails. You can also discuss programming matters in the discussion forum and participate in coding contests. In order to get the most out of this site, you either need to be able to debug your own code, or ask for help in the forum, since you won't get any thorough explanation if your solution fails.",
        "offer_training": true,
        "free_or_paid": "free"
    },
    {
        "name": "CodinGame",
        "language": "English",
        "type": "Code challenges",
        "programming_language": "Java, Python, Kotlin, Scala, JavaScript, Swift, Ruby, C, Clojure, Perl, PHP, Bash, Dart, Pascal",
        "topic": "Coding practice, code challenges, coding contests, code and play, blog posts ",
        "url": "https://www.codingame.com/start",
        "description": "A website where you practice and learn while having fun. Coding challenges in a new format, where you play and compete against other developers and improve your skills in different programming languages.",
        "offer_training": true,
        "free_or_paid": "free"
    },
    {
        "name": "Hacker Noon",
        "language": "English",
        "type": "Tech articles",
        "programming_language": "JavaScript, Python, React",
        "topic": "tech news, articles, tutorials, blog posts, general tech, programming",
        "url": "https://hackernoon.com/",
        "description": "Website with daily updated articles in general tech as well as in programming field. Read tutorials about how to setup unit tests in a good way, and learn all about the latest news in tech.",
        "offer_training": false,
        "free_or_paid": "free"
    },
    {
        "name": "The Code Player",
        "language": "English",
        "type": "Learning platform",
        "programming_language": "HTML, CSS, JavaScript",
        "topic": "Code examples, tutorials",
        "url": "https://thecodeplayer.com/",
        "description": "Website where you can see short code examples in the format of video tutorials. You can follow along once they create code examples, and then try to apply it to your own code. Perfect for beginners who wants to get a smooth start with HTML, CSS and at a later point JavaScript.",
        "offer_training": true,
        "free_or_paid": "free"
    },
    {
        "name": "Scotch.io",
        "language": "English",
        "type": "Learning platform",
        "programming_language": "CSS, Python, JavaScript, Node, Vue, React, Angular",
        "topic": "Online courses, tutorials",
        "url": "https://scotch.io/",
        "description": "Learn how to code by joining some of the courses on this website, or read the tutorials published here. You will find courses and articles handling many different programming languages, which makes it likely for you to find something that fits your needs.",
        "offer_training": true,
        "free_or_paid": "free"
    },
    {
        "name": "Classpert",
        "language": "English, Spanish, Japanese, French, Spanish, Portuguese",
        "type": "Education platform",
        "programming_language": "Angular, Express, Bootstrap, jQuery, Node, Python, JavaScript, PHP, CSS, HTML, Django, GraphQL, Flask, React, Ruby, Ruby on Rails, Sass, Svelte, Vue",
        "topic": "online courses",
        "url": "https://classpert.com/",
        "description": "Platform where hundreds of online educations has been gathered. Find programs, courses and even college and university rated educations from different schools.",
        "offer_training": true,
        "free_or_paid": "paid"
    }
    

]